[{"title":"梅德韦杰夫：关于美国战略家","date":"2022-03-24T03:13:41.000Z","path":"2022/03/Medvedev-About-American-strategists/","text":"德米特里·梅德韦杰夫 (Dmitry Medvedev) 3月23日，在Telegram发布了一篇文章，关于美国战略家, 原文是俄语的，自动翻译到了中文&#x2F;英文，通过此文可以让我们了解俄罗斯是怎么看最近的世界形势的。 关于美国战略家 美国在二战后没有找到好的战略家。他们不需要。毕竟，你总是可以大量印刷绿票子，还有着忠诚的附庸（抱歉，是盟友）和最高质量的武器。与此同时，美国本身也在不断地发动毫无意义的战争，而且通常远离其领土。没有规则，也没有顾虑国际社会。拥有放弃一切和所有人的权利的美国，总是在‘游戏’即将失败时退出‘游戏’。留下鲜血、废墟、政治与经济的破坏。这已经在朝鲜、越南、伊拉克、阿富汗和其他国家得到印证。仅在越南战争期间，美国人就杀死了这个国家超过一百万的居民。是的，在美国谁还记得这件事？ 美国人对未来几乎没有兴趣，除非是关于他们自己的收入、他们的家、他们的计划。有一次，我问一位美国总统，在他们‘出手相助’三个月后，中东地区将会发生什么，他平静地回答说：‘我们还没想那么远，这太长远了！’然后很明显，这是美国人看待他人问题的本质。他们根本不在乎接下来会发生什么以及与谁发生。他们不会隐藏它。 三十年来，俄罗斯一直是同样平庸原始游戏的目标。只有一种解释——她是敌人。即使没有更根本的意识形态矛盾，苏联还有其他合法的继承者吗？这意味着，（对美国而言）俄罗斯必须受到羞辱、限制、分裂和摧毁。在不久的将来，这将如何在欧洲和整个世界引起共鸣？没关系。甚至没有人想过它。 如果有摧毁俄罗斯的战术目标，为什么还要制定长期战略呢？现在让我们想象一下，假设美国在这一轮对抗中取得了成功。白宫狭隘的战略家们在俄罗斯造成了系统性的政治和经济危机，他们削弱并分裂了一个巨大而复杂的国家。结果是：拥有最大规模核武器的国家，政治体制不稳定，领导软弱，经济崩溃，而瞄准美国和欧洲的核弹头数量又是最多的。或者，在俄罗斯的地盘上出现五六个‘新国家’，就像他们在上世纪90年代设想的那样，而每一个这样所谓的‘国家’都有自己的战略武器。它没有让你想起什么吗？一个无法管理的，怪胎、狂热分子和激进分子掌权的行走之地？这是反乌托邦故事情节还是疯狂的未来预测？……不，这是美国这种战略的真实前景。然后下一个目标是彻底削弱中国。我们）离严重的全球危机只有几步之遥了，能源和粮食危机，所有集体安全体系的崩溃，紧接下来就是大规模核爆。。 先生们，你们觉得这个前景怎么样？伟大的计划！太棒了，来自国务院和国会大厦的战略家！太棒了，K 街分析师！布拉沃，参议院的高级成员，布拉沃先生。总统！你已经过了你的生活，你不能害怕，因为在 80 岁的时候，没有什么是特别可怕的。 当然，俄罗斯绝不会允许这样的事态发展。今天每个人都清楚这一点。此外，与希望我们祖国灭亡的美国建制派不同，俄罗斯希望将美国视为一个强大而聪明的国家，而不是一个那些逐渐陷入老年痴呆的人的最后避难所。一个负责履行大国所有职能的国家。一个试图解决其许多内部问题的国家，并且不破坏其他国家的发展。这一切都是可能的。当然，除非你认为美国总统的名字是弗拉基米尔·泽连斯基，而且还不定期地询问助手如何正确拼写伊拉克或伊朗 About American strategists America did not find good strategists after World War II. They were not needed. After all, you can always print a lot of new green papers, there are loyal vassals (sorry, allies) and weapons of the highest quality. At the same time, the United States itself constantly waged senseless wars, and usually far from its territory. Without rules and without looking back at the world community. With the right to abandon everything and everyone, to leave the game as soon as this game is close to losing. And leave behind blood, ruins, political and economic devastation. This has already happened in Korea, Vietnam, Iraq, Afghanistan and other countries. During the years of the Vietnam War alone, the Americans killed more than a million inhabitants of this country. True, who remembers this in America? Americans have little interest in the future - unless it’s about their own income, their home, their plans. At one time, I was amazed when one of the US presidents, in response to my question about what will happen to the Middle East region three months after their “help”, calmly replied: “But we don’t think so far. Too long!” Then it became clear that this was the essence of the American view of the problems of others. They simply do not care what and with whom will happen next. They don’t hide it. For the past thirty years, Russia has been the target of the same mediocre and primitive game. There is only one explanation - she is an enemy. What other legal successors of the USSR are there, even if there are no more fundamental ideological contradictions? This means that Russia must be humiliated, limited, shaken, divided and destroyed. How will this resonate in the near future in Europe and in the world as a whole? Never mind. Nobody ever even thought about it. If there is a tactical objective to destroy Russia, why have a long-term strategy at all? Now let’s imagine that America succeeded in this round of confrontation. The narrow-minded strategists from the White House have caused a systemic political and economic crisis in Russia. They weakened and led to a split a huge, very complex country. And here is the result: the largest nuclear power with an unstable political regime, weak leadership, a collapsed economy and the maximum number of nuclear warheads aimed at targets in the US and Europe. Or, in general, five or six “new countries” in the place of Russia, as they dreamed overseas in the 90s, where each such “country” has its own strategic weapon. Doesn’t it remind you of anything? An unmanaged “walking field” where freaks, fanatics and radicals are in power? A plot from a dystopia or a crazy futurological forecast? pulp fiction? No, this is a real prospect of such a strategy. And then the next goal is the total weakening of China. And then there are only a couple of steps left before the most severe global crisis, the energy and food collapse, the failure of all collective security systems and, soon, the Big Nuclear Bang, which opens the way to a new universal singularity - to the Underworld. How do you like this prospect, gentlemen? Great plan! Bravo, strategists from the State Department and the Capitol! Bravo, K Street Analysts! Bravo, senior members of the Senate, bravo Mr. President! You have already lived your life, you can not be afraid, because at the age of 80 nothing is especially scary. Of course, Russia will never allow such a development of events. This is clear to everyone today. Moreover, unlike the American establishment, which wants the end of our Motherland, Russia wants to see the United States as a strong and intelligent country, and not the last refuge of those who gradually fall into senile insanity. A responsible state that performs all the functions of a great power. A state that is trying to solve its many internal problems, and does not undermine the development of other countries. All this is possible. Unless, of course, you think that the US president’s name is Volodymyr Zelensky and do not periodically ask aides how to spell Iraq or Iran correctly… Об американских стратегах У Америки не нашлось хороших стратегов после Второй мировой войны. Они были не нужны. Ведь всегда можно напечатать много новых зелёных бумажек, есть преданные вассалы (простите, союзники) и оружие самого высокого качества. При этом сами США постоянно вели бессмысленные войны, причём обычно – вдали от своей территории. Без правил и не оглядываясь на мировое сообщество. С правом всё и всех бросить, выйти из игры, как только эта партия близка к проигрышу. И оставить после себя кровь, руины, политическую и экономическую разруху. Так уже было в Корее, во Вьетнаме, в Ираке, в Афганистане и других странах. Только в годы вьетнамской войны американцы убили более миллиона жителей этой страны. Правда, кто об этом помнит в Америке? Американцев мало интересует будущее – если речь не идёт об их собственных доходах, их доме, их планах. В своё время я был поражён, когда один из президентов США в ответ на мой вопрос, что же будет с Ближневосточным регионом через три месяца после их «помощи», безмятежно ответил: «А мы так далеко не загадываем. Слишком долгий срок!» Потом стало понятно, что именно в этом – суть американского взгляда на проблемы других. Им просто наплевать, что и с кем станется дальше. Они этого и не скрывают. В течение тридцати последних лет целью такой же бездарной и примитивной игры была Россия. Объяснение одно – она враг. Какие тут ещё правопреемники Союза ССР, даже если нет больше принципиальных идеологических противоречий? Значит, надо Россию унизить, ограничить, расшатать, разделить и разрушить. Как это отзовётся в ближайшем будущем в Европе и в мире в целом? Неважно. Об этом никто никогда даже не задумывался. Если есть тактическая задача разрушить Россию, зачем вообще долгосрочная стратегия? Теперь давайте представим, что в этом раунде противостояния Америке всё удалось. Недалекие стратеги из Белого дома вызвали в России системный политический и экономический кризис. Ослабили и привели к расколу огромную, очень сложную страну. И вот результат: крупнейшая ядерная держава с нестабильным политическим режимом, слабым руководством, разваленной экономикой и максимальным количеством ядерных боеголовок, направленных на цели в США и Европе. Или вообще пять-шесть «новых стран» на месте России, как мечтали за океаном в 90-е годы, где у каждой такой «страны» своё стратегическое оружие. Ничего не напоминает? Неуправляемое «гуляй-поле», где у власти фрики, фанатики и радикалы? Сюжет из антиутопии или безумного футурологического прогноза? Pulp fiction? Нет, это реальная перспектива такой стратегии. А дальше следующая цель – тотальное ослабление Китая. И тогда остаётся лишь пара шагов до тяжелейшего глобального кризиса, энергетического и продовольственного коллапса, отказа всех систем коллективной безопасности и в скором времени – Большого ядерного взрыва, открывающего путь к новой вселенской сингулярности – в Преисподнюю. Как вам такая перспектива, господа? Отличный план! Браво, стратеги из Госдепа и Капитолия! Браво, аналитики K Street! Браво, престарелые члены сената, браво Mr. President! Вы уже пожили своё, можно не бояться, ведь в 80 лет уже ничего особенно не страшно. Само собой такого развития событий Россия никогда не допустит. Это ясно сегодня всем. Причём, в отличие от американского истеблишмента, желающего конца нашей Родине, Россия хочет видеть США сильной и умной страной, а не последним пристанищем тех, кто постепенно впадает в старческий маразм. Ответственным государством, выполняющим все функции великой державы. Государством, которое пытается решать свои многочисленные внутренние проблемы, а не подрывает развитие других стран. Всё это возможно. Если вы, конечно, не считаете, что президента США зовут Володимир Зеленьский и не спрашиваете периодически у помощников, как правильно пишется – Ирак или Иран…","tags":[]},{"title":"俄罗斯总统普京2月24日电视讲话全文","date":"2022-02-25T09:32:21.000Z","path":"2022/02/putin-speech-on-feb-24/","text":"当地时间2月24日凌晨，俄罗斯总统普京授权在顿巴斯展开军事行动，乌克兰局势风云突变。在24日的电视讲话中，普京再一次强调：过去30年间，我们一直展现坚持和隐忍，不断尝试同北约主要国家就欧洲的平等和不可分割安全达成共识。但我们等到的回应只有无耻的欺骗、谎言，亦或是施压与恫吓，北约置俄的抗议与关切于不顾，仍然不断继续扩张。北约的军事机器已直抵俄边境。 俄总统普京2月24日电视讲话（全文） 作者： 弗拉基米尔·普京 尊敬的全体俄罗斯公民！亲爱的朋友们！ 今天，我认为有必要再次就顿巴斯局势和其他涉及俄安全的问题发表讲话。 我在21日讲话开始时列举了一系列对俄构成致命威胁的问题，这些问题是由一些不负责任的西方政客经年累月奉行错误对俄政策造成的，特别是北约东扩，将军事基础设施部署抵近俄边境。 众所周知，过去30年间，我们一直展现坚持和隐忍，不断尝试同北约主要国家就欧洲的平等和不可分割安全达成共识。但我们等到的回应只有无耻的欺骗、谎言，亦或是施压与恫吓，北约置俄的抗议与关切于不顾，仍然不断继续扩张。北约的军事机器已直抵俄边境。 是谁给了北约底气，让他们如此大言不惭地从自身特殊性、绝对正确和肆意妄为的立场出发同我们打交道？让他们以这种轻视蔑视的态度对待我们的利益和合理合法要求与主张？ 答案显而易见。苏联自上世纪80年代末不断走向削弱，之后彻底分崩离析。今时今日，俄仍应从中吸取教训，苏联解体证明，权力和国家意志的瘫痪是走向全面倒退和瓦解的开端。我们不知从何时起变得不自信了，从此世界力量对比的平衡也被打破。 曾经的一系列国际条约事实上已不复存在。承诺约定和请求百无一用。所有不为霸权国家满意的执政当局均被贴上过时、没用的标签。相反，一切他们眼中能为己所用的政府则不惜一切代价去扶持，哪怕是用野蛮的手段也在所不惜。任何不与之同流合污的力量则会被敲碎膝盖。 我讲的这些不仅攸关俄罗斯，不仅只是俄罗斯的关切，更关乎整个国际关系体系，甚至是美国的盟友们。苏联解体后世界版图被重新划分，二战后所形成的国际法准则的核心、基本内容，以及二战胜利成果却成为那些自称为冷战胜利者实现霸权的绊脚石。 当然，在现实生活中，在国际关系和国际规则适用过程中，国际形势以及国际力量对比的变化都是重要考量因素。应该保持专业、平稳和耐心态度，清楚定位自身责任，尊重所有国家的利益。但一些国家不断强调自身的绝对优先，谋求一言堂，仅接受于己有利的方案，在这种下三滥手段不断充斥国际环境的背景下，事态从最开始就朝着另一个方向发展。 类似的例子信手拈来。北约在未经联合国安理会授权的情况下对贝尔格莱德进行血腥的军事行动，直接动用飞机和导弹，持续数周对市政设施及关乎民生的基础设施进行轰炸。 但西方国家总是选择遗忘这些事实，当我们提起时，他们不愿谈及国际法准则，反而宣称是形势使然。 之后又轮到伊拉克、利比亚和叙利亚。对利比亚非法动武，歪曲联合国安理会涉利比亚问题决议，导致该国彻底被摧毁，沦为国际恐怖主义的温床，陷入人道主义灾难和内战不断的深渊。利比亚数百万人甚至整个地区的人民都深陷灾难，滋生了从北非和中东到欧洲的大规模移民潮。 叙利亚也遭遇同样命运。西方国家未经叙政府同意和联合国安理会授权便对该国动武，这是赤裸裸的侵略和干涉。 然而，最令人发指的是在毫无法理依据的情况下入侵伊拉克。侵略的由头是美国言之凿凿宣称伊境内有大规模杀伤性武器。为了师出有名，美国务卿在全世界面前晃了晃装有白色粉末的试管，向世人宣称是伊拉克正在研发的化学武器。然而事实证明，所有的一切都是骗局，是烟雾弹，伊拉克境内根本没有任何化学武器。虽然令人难以置信，但事实就是事实。这一切都是美国政府在联合国舞台上撒下的谎言，最终导致无数伤亡和破坏性后果，恐怖主义更是趁势做大。 只要是西方试图染指建立所谓“秩序”的地方，就会发生流血和伤痛，就会给国际恐怖主义和极端主义以可乘之机。这些例子只是最令人发指的一小部分，西方国家藐视国际法的例证远不止于此。 其中就包括曾向俄罗斯作出的北约绝不东扩承诺。他们欺骗了我们，满嘴跑火车。的确大家常说，政治是肮脏的。也许是吧，但不至于肮脏至此。这种耍滑头的行为违反了国际关系准则，尤其是各国公认的道德和道德规范。正义和真理何在？全是谎言和虚伪。 美政客、政治评论者和记者常说，近年来美内部建立了一个真正的“谎言帝国”。毋庸置疑，事实就是如此。但需要承认的是，美仍是一个伟大的国家和世界主要大国。其附庸国不仅在所有问题上对其随声附和、言听计从，甚至还效仿其所作所为，欣然接受其制定的规则。所以我们完全有理由自信地说，美按照其设想和模式建立的西方集团就是一个彻头彻尾的“谎言帝国”。 苏联解体后，尽管新生的俄罗斯展现出前所未有的开放性和同美西方合作意愿，并且几乎是单方面进行裁军，但美西方仍企图压榨，甚至彻底摧毁俄。上世纪90年代及21世纪初的情况就是如此。当时，所谓的集体西方大肆支持俄南部的分裂主义和受雇佣匪徒。我们将永远铭记，为了最终打断高加索地区国际恐怖主义的脊骨，俄付出了多少人员伤亡，蒙受了多大损失，经历了多么艰难的考验。实际上，直至最近，还有国家不断企图利用俄服务自身利益，摧毁俄传统价值观并将自身虚假价值观强加于俄，以此从内部侵蚀我们和我们的人民。他们还企图将其国内方针强加于俄，而这将直接带来衰退和堕落，因为这是违反人性的。任何人的上述图谋永远都不可能得逞。 尽管2021年12月，我们再次试图同美方及其盟友就欧洲安全保障原则和北约不东扩达成共识。但这一切都是徒劳。美方固执己见，认为没有必要同俄就俄核心关切达成共识，为达成自身目的，罔顾俄利益。 面对当前局势，我们产生一个疑问：接下来该怎么办？还在等什么？我们清楚地了解1940年和1941年初的历史。当时，苏联曾千方百计试图防止或至少拖延战争爆发。为此，全力避免挑衅潜在的侵略者，放弃实施或推迟为筹备应对侵略所必要的行动。而最终采取行动时已为时已晚。 结果是，1941年6月22日纳粹德国宣布对俄开战，而俄却未做好应对准备。我们成功阻挡并摧毁了敌人，但同时付出了惨痛代价。伟大卫国战争前夕，对侵略者采取绥靖政策大错特错，让我们的人民付出巨大代价。战争伊始，我们丧失了大量具有重要战略意义的领土和数百万民众。我们不会也无权重蹈历史的覆辙。 那些谋求霸权的国家公开、毫无成本且毫无根据地将俄罗斯宣称为敌人，这些国家的确在金融、科技和军事领域拥有强大实力，俄方对此有客观认识，这些国家威胁对俄实施经济制裁的声音不绝于耳，俄方对此也进行了客观评估，分析我们对可能的经济制裁拥有哪些应对能力，我们进行的研判非常客观和现实。 在军事领域，尽管俄罗斯在苏联解体后军事实力受到了很大打击，但俄仍是当今世界核武器力量最强的大国之一，且在众多新式武器领域保有一定优势，因此任何试图袭击俄罗斯的潜在入侵者定会招致灾难性后果，国际社会对此拥有共识。国防等领域技术发展日新月异，相应军事技术的领先地位也在不断易主，如军事技术成果应用不断向俄边境逼近，而俄却无动于衷，那么相关军事设施将在几十年后甚至未来永远对俄造成长期增长、完全无法承受的威胁。 即便当前，随着北约不断东扩，俄安全形势也在不断恶化，其危险性与日俱增。不仅如此，北约高层日前直接声称将加快其军事设施向俄边境线推进的进程。换句话说，北约的立场愈发强硬，俄不能再坐以待毙，坐以待毙是极其不负责任的。 北约进一步东扩，将军事装备部署在乌克兰境内于俄来讲绝不可接受，当然，问题不在于北约本身，北约只是美国的外交工具，在俄罗斯的毗邻地区（这些地区原本历史上是俄罗斯的领土），建立起对俄极具敌意的反俄阵线，且这些国家完全受外国操控，北约国家的军事力量不断在加强，还部署最先进的武器装备。 在美及其盟友口中声称的遏俄政策，所谓的地缘政治红利，对俄而言却是生与死的问题，毫不夸张，这是俄命脉攸关的问题，不仅威胁到俄国家利益，甚至威胁到俄主权，关乎国可为国的问题。这就是我不止一次提到的“红线”，而他们已经踏过了这条红线。 至于说到顿巴斯地区形势。我们看到，2014年策动乌克兰政变的那伙人攫取政权，在外部势力帮助下举行了“作秀般”的选举，彻底放弃和平解决争端。8年间，俄方不断作出一切努力，希望局势能够通过和平政治方式化解。最终看来，一切皆为徒劳。 正如我在上一次电视讲话中所说，我们不能对发生在顿巴斯地区的事漠视旁观。如今，我们不可能再坐视不管了。我们必须立即阻止这样的噩梦继续下去，必须立即阻止乌当局继续屠杀对俄寄予厚望的数百万顿巴斯地区居民。俄承认顿涅茨克人民共和国和卢甘斯克人民共和国独立的主要原因，就是顿巴斯地区居民的愿望、感受以及他们承受的痛苦。 我还想强调的是，北约主要成员国为了达到其自身目的，对乌极端民族主义者和纳粹主义者予以全面支持，而这些势力永远不会放过克里米亚和塞瓦斯托波尔的居民，仅仅因为他们行使了自由选择的权利，回到了俄的怀抱。 毫无疑问，这些势力会像潜入顿巴斯地区一样潜入克里米亚并挑起战争，像打着讨伐旗号的乌民族主义者屠杀手无寸铁的顿巴斯地区居民一样，屠杀克里米亚居民，这些乌民族主义者在二战时曾是希特勒的帮凶。 乌局势发展的整个过程以及对有关信息的分析表明，俄同这些势力的冲突是不可避免的，这只是时间问题，这些势力一直在积极准备，伺机而动。现在，这些势力还开始要求拥有核武器，俄决不会允许这种事情发生。 我曾说过，苏联解体后俄已接受了新的地缘政治现实。俄始终尊重在前苏联地区成立的各个国家，始终尊重它们的主权，俄帮助哈萨克斯坦平定乱局、维护国家统一和领土完整，这就是最好的证明。但乌不断对俄安全构成威胁，这让俄充满不安全感并无法正常发展。 我想提醒大家的是，2000年至2005年间，俄在高加索地区对恐怖分子进行了军事打击，捍卫了俄领土完整。2014年，俄对克里米亚和塞瓦斯托波尔居民予以了支持。2015年，俄出兵叙利亚，有效阻止恐怖分子从叙流入俄。俄已无其他自卫方式。 目前的情况也是一样的。我们除了采取今天不得不采取的措施以外，已经没有其他保家卫国的方法了。形势迫使我们必须采取坚决果断的行动。顿涅茨克人民共和国和卢甘斯克人民共和国已向俄求助。 因此，根据联合国宪章第7条第51款和俄联邦委员会今年2月22日批准的俄同顿涅茨克人民共和国和卢甘斯克人民共和国友好互助条约，经俄联邦安全会议批准，我已决定采取特别军事行动。 此次军事行动的目标在于保护那些八年来一直遭受基辅当局欺凌乃至种族灭绝的人们。为此，我们将致力于乌克兰的去军事化和去纳粹化，并将那些对包括俄公民在内的平民犯下无数血腥罪行的分子绳之以法。 但我们不会侵占乌克兰领土，也不会以武力逼迫任何人。此外，我们注意到，近期在西方国家所谓“确定第二次世界大战成果的相关文件系苏联极权主义政权签署，不应继续履行”的论调甚嚣尘上。下面我将作出回应。 第二次世界大战的成果和我国人民为战胜纳粹主义所作出的牺牲都是神圣的。这与基于战后数十年发展得出的崇高价值——人权与自由并不矛盾，也不会抹杀《联合国宪章》第一条所规定的民族自决权。 请注意，无论是在苏联成立时还是在二战后，那些现代乌克兰领土上的居民，他们对生活的想法从来无人问津。 我们政策的核心是自由，包括让所有人自主选择本人和子女未来的自由。我们认为，生活在当今乌克兰领土上的所有民族、全体人民都应享有这种选择权。 在此，我向乌克兰公民发出呼吁。2014年，俄罗斯有义务保护克里米亚和塞瓦斯托波尔人民免遭你们口中的“纳粹分子”伤害。（因为）两地人民做出了选择，即与他们历史上的祖国——俄罗斯站在一起，这也得到了俄方的支持。再次强调，除此之外，他们别无选择。 此番行动并非意在侵犯乌克兰及其人民的利益，而是为了保卫俄罗斯自身、为了击退那些绑架乌克兰并试图利用其危害我国及我国人民的分子。 再次强调，我方行动是旨在抵御眼下威胁、避免灾难事态扩大的自卫行为。尽管十分困难，但我还是希望广大乌克兰公民能够理解这一点，并（同俄方）开展合作，以便尽快翻过悲惨一页，携手前行，不要再允许任何人对我们两国的内政和彼此关系横加干涉，而应做到独立自主，如此，才能为解决问题创造必要条件，打破国界阻隔，从内部增强彼此凝聚力。我相信这才是我们两国的未来。 我还要向乌克兰武装部队军人发出呼吁。 亲爱的同志们! 你们的父辈、祖辈、曾祖辈同纳粹作战，保卫我们共同的家园，不是为了今天的新纳粹分子在乌当政。你们宣誓效忠的是乌克兰人民，而不是掠夺乌克兰、侮辱这些人民的反人民政权。不要执行他们的非法命令。我呼吁你们立即放下武器回家。我明确指出，所有听从这一要求的乌士兵将顺利离开战区，和家人团聚。我想再次强调，可能发生的流血事件的全部责任将完全由乌当局承担。现在我想对那些受外界影响企图干涉当前局势的人说几句：无论是谁想干涉我们，甚至是危及俄国家和人民，他都必须知道，俄罗斯将立刻作出反应，并将让其遭受历史上从未经历过的后果。俄已做好应对任何事态的准备，也做出了所有必要的决定，希望大家听到我们的声音。 亲爱的俄罗斯公民! 一个国家和民族的富强和存亡，其成就与活力始终源于其深厚根基，即文化和价值观，先人的经验和传统，也取决于其迅速适应不断变换的外部环境的能力，取决于社会凝聚力与勇往直前的决心。 力量总是必要的，但力量可以有不同的性质。我在讲话开始时提到的“谎言帝国”政治首先就是建立在粗暴、直接的武力之上，俗话称“四肢发达，头脑简单”。 真正的力量在于正义和真理，而正义和真理在我们这边。这样，就没有理由不同意，拥有力量、准备斗争是维护国家独立与主权的基础，只有在这一基础之上才能够修身、齐家、治国。 同胞们！ 我相信，忠于祖国的俄军官兵们将专业而勇敢地履行自己的职责。我毫不怀疑，负责俄经济、金融系统和社会领域稳定发展的各级机关和专家们、企业家以及整个工商界将协调一致，高效工作。我希望议会所有政党和社会力量都能秉持一致的爱国立场。 俄罗斯的命运始终掌握在可靠的俄各族人民手中。这意味着，我们所做的决定必将得到执行，我们的目标必将能够实现，国家的安全必将得到可靠保障。 我相信你们的支持，相信对祖国的爱能给予我们必胜的力量。","tags":[{"name":"Putin","slug":"Putin","permalink":"https://blog.zfdang.com/tags/Putin/"},{"name":"普京","slug":"普京","permalink":"https://blog.zfdang.com/tags/%E6%99%AE%E4%BA%AC/"}]},{"title":"俄罗斯总统普京2月21日电视讲话全文","date":"2022-02-25T09:32:12.000Z","path":"2022/02/putin-speech-on-feb-21/","text":"2022年2月21日，俄罗斯总统普京在克里姆林宫发表了长达将近一个小时的演讲，就俄乌局势发表了他的看法，随后他宣布承认位于乌克兰东部地区的顿涅茨克和卢甘斯克共和国独立。 在这份长达1万3千余字的演讲稿中，普京在前半部分回顾了历史上苏联遗留下的领土划分问题，对苏联统治者错误的治理方式做出了深刻反思；后半部分则表达了他对乌克兰有意逃避历史、不负责任，纵容民族主义情绪甚嚣尘上的批评和愤懑。文中，普京还多次将矛头指向以美国为首的北约盟友，指责他们屡次背弃承诺，一次次实现北约东扩，并最终干预乌克兰领土与主权的侵略行径。 普京就俄乌局势及承认顿巴斯地区独立发表重要演讲（全文） 作者： 弗拉基米尔·普京 亲爱的俄罗斯公民们！亲爱的朋友们！ 我演讲的主题有关乌克兰局势，以及为什么乌克兰局势对我们如此重要。当然，我的呼吁同样也针对我们在乌克兰的同胞。 我将非常详细而严肃地陈述这番话。问题十分严重。 顿巴斯（乌克兰东部地区）的局势再次变得严峻而尖锐。今天我向你们讲话，不仅是为了评估正在发生的事情，而且是为了告知你们我们正在做出的决定，以及在这个方向上可能采取的进一步措施。 我再次强调，对我们来说，乌克兰不仅仅是一个邻国：它是我们自己的历史、文化、精神空间不可分割的一部分。他们是我们的战友、亲人，其中不仅有同事、朋友、前同事，还有亲人：是有血缘联系，与我们有亲情的人。 长期以来，在古俄罗斯西南土地上的居民，称他们自己为俄罗斯人和东正教徒。直到 17世纪，这些领土的一部分与俄罗斯国家重新统一，一直到之后。 在我们看来，事实上我们都知道这一点，我们谈论的也是众所周知的事实。为了了解今天发生的事情，解释俄罗斯的行动动机，和我们为自己设定的目标，我们至少有必要谈谈这个问题的历史。 所以，我将从“现代乌克兰完全以及全部都由俄罗斯创造”的这个事实开始，更准确地说，是布尔什维克和共产主义时代的俄罗斯缔造了乌克兰。这一过程几乎是在1917年十月革命之后开始的，列宁和他的同志对俄罗斯采取了一种非常粗鲁的统治方式——分离、撕毁了它自己历史领土的一部分。当然，没有人问过居住在那里的数百万人的感受。 之后，在伟大的卫国战争结束后，斯大林重新整合了苏联，并将一些以前属于波兰、罗马尼亚和匈牙利的土地转让给了乌克兰。同时，作为补偿，斯大林将部分原德国领土赠与了波兰。1954年，赫鲁晓夫因某种原因将克里米亚从俄罗斯手中夺走，赠送给乌克兰。实际上，这就是苏维埃乌克兰领土的形成过程。 乌克兰的东正教教堂 但现在，我想将注意力特别集中在苏联成立的初期。我认为这对我们来说非常重要。正如他们所说，你必须了解历史的深处。 您还记得吗？在1917年十月革命和随后的内战之后，布尔什维克开始建立了一个新的国家，他们之间出现了相当尖锐的分歧。斯大林在1922年提出按照自治原则建设国家，即赋予了共和国——也是未来的行政领土单位——让他们加入一个国家时的广泛权力。 列宁批评了这一计划，并提出向民族主义者做出让步，他当时称他们为“独立分子”。正是这些列宁主义思想，事实上，邦联国家制度和民族自决权直至分离的口号，构成了苏维埃国家地位的基础：在1922年，它们被载入《独立宣言》。苏联正式形成后，以及在列宁去世后，它们都被写入了1924年的苏联宪法中。 许多问题在这里就出现了。其中第一个问题，实际上是主要的：为什么有必要从领主的肩膀上满足前帝国边区无限增长的民族主义野心？就是说，转移到新成立的，通常是任意成立的行政单位——联盟共和国，而这些往往是与他们毫无关系的巨大领土。我再说一遍，不仅是领土，而是将历史上的俄罗斯人口一起转让出去。 而且，事实上，这些行政单位被赋予了民族国家形成的地位和形式。我再次反问：为什么有必要给予最狂热的民族主义者从未梦想过的、如此慷慨的礼物，甚至给予共和国无条件从一个统一国家脱离的权利？ 乍一看，这似乎是不可理解的，近乎某种疯狂。但这只是乍一看，我们还有一个解释：革命后，布尔什维克的主要任务是不惜一切代价，确切地说是不惜一切代价，继续掌权。为此，他们不惜一切：在德皇的德国及其盟国处于最困难的军事和经济形势下，第一次世界大战的结果实际上已经注定，为了满足国内民族主义者的任何要求、任何愿望，他们不惜牺牲布雷斯特条约的屈辱条件。 从俄罗斯及其人民的历史命运的角度来看，列宁主义式的国家建设原则不仅是一个错误，而且正如很多人所说，它比错误更糟糕。1991年苏联解体后，这种错误的方式变得越发明显。 过去的事情当然不能改变，但至少我们要坦诚相待，不带任何保留，不带任何政治色彩。我只能以我自己的名义补充我对当前政治形势的考虑，无论他们在某个特定时刻看起来多么壮观，在任何情况下都不应、也不能作为建国基本原则的基础。 我现在不怪任何人，因为当时我们国家的局势以及内战形势，非常困难和危急。今天我只想说：就是这样，这是历史事实。实际上，正如我已经说过的，正是由于布尔什维克政策，苏维埃乌克兰出现了。即使在今天，它也有充分的理由被称为“以弗拉基米尔·伊里奇·列宁命名的乌克兰”。列宁是乌克兰的建造师，档案文件充分证实了这一点，包括列宁对顿巴斯的严厉指示，顿巴斯实际上是被“挤进”了乌克兰。现在，在乌克兰的那些“懂得感恩的后裔”已经在乌克兰陆续拆毁了列宁的纪念碑。这就是他们所说的“去共产主义化”。 你们是想“去共产主义”吗？嗯，这很适合我们。但正如他们所说，没有必要中途停下来。我们已准备好向你们展示真正的去共产化对乌克兰意味着什么。 基辅的东正教教堂 回到问题的历史，我想再次强调：1922 年的苏联，是在前俄罗斯帝国的领土上成立的。但事实本身立即表明，要保存这样一个巨大而复杂的领土，或者根据提议的无定形的、实际上是联邦原则来管理它，是根本不可能的。他们完全脱离了现实和历史的传统。 红色恐怖和向斯大林主义独裁的迅速过渡，共产主义意识形态的主导地位和共产党对权力的垄断，国有化和国民经济的计划体制……这一切都变成了一个简单的宣言，这是很自然的，一种宣言的形式，没有任何实际作用的国家制度的原则。实际上，联盟共和国没有任何主权权利，它们根本不存在。但在实践中，苏联却创建了一个严格集中、绝对单一的国家。 事实上，斯大林的实践完全不是列宁的构想，而是他自己创造的国家结构。但他没有对制度文件、国家宪法进行相应的修改，也没有正式修改公开的以列宁主义建设苏联的原则。很显然，他似乎也没有必要这样做——在极权主义政治条件下，一切正常，从外表上看，苏联看起来很漂亮、有吸引力，甚至是超级民主的。 然而，很遗憾，非常遗憾，在我们整个国家建立的基本的、正式的法律基础中，那些可恶的、乌托邦式的、受革命的启发，以及对任何正常国家来说绝对具有破坏性的幻想，并没有被及时清除掉。没有人考虑过未来，就像我们从前那样。 共产党的领导人似乎确信他们已经成功地建立了一个坚实的政府体系，他们通过他们的政策最终解决了民族问题。但伪造、替代概念、操纵公众意识和欺骗是代价高昂的。民族主义的野心并没有消失，这为民族主义破坏国家埋下了的地雷，他们伺机而动。请让我强调：这个地雷就是脱离苏联的权利。 1980年代中期，在社会经济问题日益突出、计划经济危机明显、民族问题日益复杂的背景下，其本质不是欧盟人民具备了一些期望和未实现的愿望，而是日益增长的当地精英的胃口，越来越大。 然而，苏共领导层并没有深入分析形势，采取适当措施。他们不是在经济方面，对政治体制和国家结构进行渐进和平衡的转变，而是把自己限制在直言不讳地谈论恢复经济，还在用列宁主义式的民族自决原则。 此外，在共产党内部展开的权力斗争过程中，各方为了扩大支持基础，开始不加思索地煽动、鼓动民族主义情绪，玩弄它们，他们希望向潜在的支持者许诺任何事情。在表面民粹主义谈论民主和建立在市场经济或计划经济基础上的美好未来的背景下，人民却是真正的贫困以及物资完全短缺，当权者甚至没有想到这会不可避免地给国家带来悲惨的后果。 随后他们完全走在了苏联成立之初的道路上，只为了满足在自己党内成长的民族主义精英的野心，同时忘记了苏共已不再掌握在手中。上帝啊，这样作为斯大林式的国家恐怖独裁政权还在维持权力和统治国家。而连党内臭名昭著的主角，也如同晨雾一般，在他们眼前消失得无影无踪。 在1989年9月的苏共中央全会上，通过了一个本质上十分致命的文件——所谓现代条件下的党的国策，苏共的纲领。它包含以下条款：“加盟共和国拥有与其作为主权社会主义国家的地位相对应的所有权利；加盟共和国的最高代表机关可以抗议和暂停联盟政府在其领土上的决定和命令。” 最后：“每个加盟共和国都有自己的公民身份，适用于所有居民。” 这样的提法和决定会导致什么，难道不是很明显吗？ 现在不是讨论州或宪法问题来定义公民身份概念的时候，也不是时候。但是，问题仍然存在：在那些已经很困难的情况下，为什么有必要以这种方式进一步动摇这个国家？事实依然存在。 在苏联解体前两年，他们的命运其实已成定局。他们现在是激进分子和民族主义者，尤其是乌克兰的激进分子和民族主义者，将获得独立的功劳归于自己。正如我们所看到的，情况并非如此。布尔什维克领导人、苏共领导层在国家建设、经济和国家政策的不同时期犯下的历史性、战略性错误，导致了我们统一的国家的解体。以苏联的名义瓦解历史上的俄罗斯，就是“他们的良心”。 尽管俄罗斯遭受了所有这些不公正、欺骗和公然抢劫，但我们的人民，正是人民，承认了苏联解体后出现的新地缘政治现实，承认了新的独立国家。我们的人民不仅承认了这一点——当时处于困境的俄罗斯甚至还帮助了其在独联体的合作伙伴，包括乌克兰的同胞们，从他们独立的那一刻起，就开始收到大量的物质支持请求。我们国家在尊重乌克兰的尊严和主权的情况下提供了这种支持。 根据专家估计，通过简单计算我们的能源价格、软贷款数量、俄罗斯向乌克兰提供的经济和贸易优惠，乌克兰在1991年至2013年期间的总收益约为2500亿美元。 但这还不是全部。到1991年底，苏联对外国和国际基金的债务总额约为1000亿美元。最初的设想是，这些贷款将由前苏联所有共和国按照其经济潜力的比例统一归还。然而，俄罗斯自行偿还了苏联的全部债务，并全部还清了，我们直到2017年才完成了这个任务。 作为回报，新独立的国家将放弃其在苏联外国资产中的份额，并于1994年12月与乌克兰达成了相应的协议。然而，乌克兰并没有签署这些协议，后来干脆拒绝遵守，对前苏联在国外的钻石基金、黄金储备以及财产和其他资产提出索赔。 然而，尽管存在众所周知的问题，俄罗斯一直与乌克兰公开、诚实地合作，而且，我再说一遍，在尊重其利益的情况下，我们的关系在各个领域都得到了发展。因此，2011年俄乌双边贸易额超过500亿美元。我注意到，2019年乌克兰与所有欧盟国家的贸易额，即在新冠疫情爆发之前，仍低于该指标。 显然，乌克兰当局更愿意以这样一种方式行事：即他们将在与俄罗斯的关系中拥有所有权利和优势，但不愿承担任何义务。 当依赖关系不再是伙伴关系，这在基辅当局方面获得了绝对不客气的性质。让我们回想一下能源运输领域的永久讹诈和天然气盗窃就足够了。 让我补充一点，乌克兰试图利用与俄罗斯的对话作为与西方讨价还价的借口，并通过与俄罗斯的和解来勒索它，从而实现对自己的特惠：他们说，否则俄罗斯对乌克兰的影响力将会增长。 同时，乌克兰当局最初，我想强调这一点——从一开始，他们就开始否认一切将我们团结在一起的东西，以及在什么样的基础上建立了乌克兰的国家地位。他们试图扭曲人民的意识和数百万人的历史记忆，以及整整几代生活在乌克兰的人。毫不奇怪，乌克兰社会面临着极端民族主义的兴起，这种民族主义采取了具有侵略性的“恐俄症”和新纳粹主义的形式。因此，乌克兰民族主义者和新纳粹分子参与了北高加索地区的恐怖团伙，他们对俄罗斯的领土侵占要求越来越高。 基辅，乌克兰反普京游行 一些外部力量也发挥了作用，在广泛的非政府组织和特殊网络服务的帮助下，他们在乌克兰扩大了客户群，并推动其代表掌权。 同样重要的是要了解，事实上，乌克兰从未有过其真正国家地位的稳定传统。并且从1991年开始，乌克兰走上了机械复制别人模型的道路，将历史和乌克兰现实隔绝。政治国家机构不断地被改造，以适应迅速形成的自私利益，而这与乌克兰人民的利益无关。 乌克兰寡头政府所谓的亲西方文明选择的全部目的不是为人民的福祉创造更好的条件，而是为俄罗斯的地缘政治对手提供服务，那些数十亿美元从乌克兰人民手中窃取，并被寡头隐藏在了他们的西方银行账户中。 一些工业金融集团，被他们用来维护党和政治，最初依靠民族主义者和激进分子。而其他人，口头上声称与俄罗斯保持良好关系，促进文化和语言多样性，并在真诚支持这种愿望的公民（包括东南部数百万居民的投票）的帮助下上台。但是，在获得职位、职位后，他们立即背叛了选民，放弃了选举承诺，在激进分子的指挥下进行真正的政治活动，有时还迫害他们曾经的盟友——那些与俄罗斯合作的提倡双语的公共组织。他们利用了支持他们的人通常守法、观点温和、以及习惯于信任当局的事实。与激进分子不同的是，他们不会表现出侵略性或诉诸非法行为。 反过来，激进分子变得愈发无礼，他们的要求逐年增加。事实证明，他们很容易一次又一次地将自己的意志强加给一个软弱的乌克兰政府，而这个政府本身就感染了民族主义和腐败的病毒，他们还巧妙地用各种以民族为由的投机行为和外国民族学的外衣来代替人民的真正文化、经济和社会利益以及乌克兰的真正主权。 乌克兰没有建立稳定的国家，政治选举程序只是一个掩护，一个掩护在各个寡头与家族之间重新分配权力和财产的屏障。 毫无疑问，对包括俄罗斯在内的许多国家来说，腐败是一个挑战和问题，它在乌克兰已经获得了一些特殊的性质。它从字面上渗透和腐蚀了乌克兰的国家地位、整个系统、所有权力分支。激进分子利用了人民的正当不满，为抗议活动背上了担子，并利用2014年的亲欧运动发动了政变。同时，他们也得到了外国的直接援助。据报道，美国大使馆对基辅独立广场所谓抗议者的物资支持每天高达100万美元。额外的巨额资金被无礼而地直接转入反对派领导人的银行账户。这大约是数千万美元。而在基辅和其他城市的街道和广场引发的冲突中，真正受伤的人、死者的家属最终得到了多少？你们最好不要问。 夺取政权的激进分子组织了一场迫害，对那些反对反宪法行动的人构成了真正的恐怖。政客、记者、公众人物被嘲笑、被公开羞辱。乌克兰城市被一波屠杀和暴力席卷，一系列高调且未受惩罚的谋杀案。我不仅不寒而栗地想起在敖德萨的可怕悲剧，和平抗议的参与者被残忍地杀害，他们在工会被活活烧死。犯下这一暴行的罪犯没有受到惩罚，也没有人在寻找他们。但我们知道他们的名字，并将尽一切努力惩罚他们，找到他们并将他们绳之以法。 2014年的政变并没有让乌克兰更接近民主和进步。在发动政变后，民族主义者和支持他们的政治势力最终使乌克兰局势陷入停顿，将乌克兰推入内战的深渊。这些事件发生八年后，这个国家分裂了。现在，乌克兰正在经历一场严重的社会经济危机。 据国际组织称，在2019年，将近600万乌克兰人——我强调，这大约是乌克兰全国人口的15%，都不是身体健全的人，他们被迫出国寻找工作。通常，这些人都是从事的临时性、非技术性的工作。以下事实也令人深思：自2020年以来，已有6万多名医生和其他卫生工作者在疫情期间离开了乌克兰。 自2014年以来，乌克兰水费上涨了近三分之一，电费上涨了几倍，家庭燃气费上涨了数十倍。许多人根本没有钱来支付公用事业费用，但他们还必须生存。 发生了什么？为什么会发生这一切？答案是显而易见的：这是因为不仅从苏联时代收到的嫁妆，而且从俄罗斯帝国收到的嫁妆都被挥霍和贪污了。包括通过与俄罗斯的密切合作，数万甚至数十万的工作机会被剥夺，而这些工作机会给人们带来了稳定的收入，并将税收带入国库。机械制造、仪器制造、电子、造船和飞机制造等行业要么躺在功劳簿上，要么被摧毁，而它们曾经不仅使乌克兰，而且使整个苏联感到骄傲。 2021 年，位于尼古拉耶夫的黑海造船厂被关闭，这第一批造船厂是在叶卡捷琳娜二世的领导下建造。著名的安东诺夫公司自 2016 年以来就没有生产过一架系列飞机，而专门生产火箭和太空技术的尤兹马什工厂和克列缅楚克钢铁厂都处于破产的边缘。这些个悲伤的清单还在继续增补。 至于整个在苏联时期建造的天然气运输系统，已经破败不堪，运行风险和环境成本都很大。 那么问题来了：贫穷、绝望、工业和技术潜力的丧失——这就是多年来愚弄和欺骗数百万人、许诺给他们天堂的亲西方的文明选择吗？ 事实上，这一切都归结为乌克兰经济的崩溃伴随着对该国公民赤裸裸的抢劫，而乌克兰本身只是被外部力量所控制、所驱使。乌克兰不仅在西方国家的要求下进行管理，而且，正如他们所说，直接在当地通过部署在乌克兰的外国顾问、非政府组织和其他机构的整个网络来进行管理。这些人对所有乌克兰最重要的人事决策、所有部门和各级政府产生直接影响：从中央到地方，对所有主要国有企业和公司，包括乌克兰国家石油天然气公司、乌克兰国家电力公司、乌克兰国家铁路公司、乌克兰国防工业集团、乌克兰邮政和乌克兰海港管理局。 在乌克兰，根本没有独立的法院。应西方国家的要求，基辅当局赋予国际组织代表优先选择最高司法机构成员的权利——即司法委员会和法官资格委员会成员的权利。 此外，美国大使馆直接控制着乌克兰国家预防腐败局、国家反腐败局、反腐败专门检察官办公室和最高反腐败法院。所有这一切都是在看似合理的借口下进行的，以提高反腐败斗争的有效性。好吧，但是结果是怎样的？腐败在乌克兰依旧盛行，甚至比以往任何时候都多。 乌克兰人自己知道所有这些管理方法吗？他们是否明白，他们的国家甚至不在政治和经济保护之下，而是沦为傀儡政权的殖民地？国家私有化导致自称为“爱国者力量”的政府失去了民族性，并一贯追求国家的彻底去主权化。 去俄罗斯化和强制同化的进程仍在继续。乌克兰最高议会不断发布新的歧视性行为，一部关于所谓土著人民的法律已经生效。那些认为自己是俄罗斯人并希望保留自己的身份、语言、文化的人被明确表示，他们在乌克兰是陌生人。 根据乌克兰语作为国家语言的法律，俄语被驱逐出学校——所有公共领域，甚至普通商店，这些所有关于所谓“肃清”权力的法律，使处理令人反感事务的公务员成为可能。 越来越多的行为使乌克兰的执法机构有理由严厉镇压言论自由、异议和迫害反对派。全世界都知道，单方面对其他国家、外国个人和法人实施非法制裁的可悲做法。在乌克兰，他们甚至超越了它的西方处理者，发明了制裁本国公民、企业、电视频道、其他媒体甚至议会代表的工具。 莫斯科牧首区的乌克兰东正教会也在基辅继续遭到屠杀。这不是情绪化的评估，具体的决定和文件都证明了这一点。乌克兰当局冷酷地把教会分裂的悲剧变成了国家政策的工具。而乌克兰现任领导人还没有回应乌克兰公民要求废除侵犯信徒权利的法律的要求。此外，乌克兰议会还登记了莫斯科宗主教区在乌克兰东正教教堂的神职人员和数百万教区居民。 乌克兰民众逃往俄罗斯罗斯托夫州 另外，我想单独谈谈克里米亚。克里米亚半岛的居民已经做出了他们的自由选择——与俄罗斯在一起。基辅当局对人民的这种明确而清晰的意愿没有什么可反对的，因此他们依靠激进的行动，依靠激进的伊斯兰组织在内的极端主义组织，依靠破坏组织的渗透，对重要的基础设施进行恐怖袭击，绑架俄罗斯公民。我们有直接的证据表明，这种激进行动是在外国情报机构的支持下进行的。 2021 年 3 月，乌克兰通过了一项新的军事战略。这份文件几乎完全致力于与俄罗斯的对抗，旨在将外国卷入与我国的冲突中。该战略提出，该组织在俄罗斯克里米亚和顿巴斯境内，实际上是一个地下恐怖分子。它还阐明了拟议战争的轮廓，它应该结束，正如今天的乌克兰战略家所认为的那样： “在国际社会的协助下，以对乌克兰有利的条件”。还有，正如他们今天在基辅所说，我也在这里引用：“在与俄罗斯联邦的地缘政治对抗中，在国际社会的军事支持下。”事实上，这无非是为对我国——对俄罗斯的敌对行动做准备。 我们也知道，已经有言论称乌克兰将制造自己的核武器，这不是空谈。乌克兰确实仍然拥有苏联的核技术和运载此类武器的手段，包括航空，以及同样由苏联设计的 Tochka-U 作战战术导弹，射程超过 100 公里。但他们会做得更多，这只是时间问题。他们有来自苏联时代的诀窍。 因此，乌克兰获得战术核武器将比其他一些国家容易得多，我就不点名了，这些国家实际上进行了这种开发，特别是在国外技术支持的情况下。我们也不应该排除这种情况。 随着乌克兰大规模杀伤性武器的出现，世界、欧洲的局势，尤其是对我们——对俄罗斯而言，将以最激进的方式发生变化。我们不能不对这种真正的危险做出反应，特别是，我再次强调，西方赞助者可能促成这种武器在乌克兰出现，从而对我们的国家造成另一个威胁。我们可以看到，基辅政权的军事抽水是如何持续进行的。自2014年以来，仅美国就为这些目的拨款数十亿美元，包括供应武器、设备和培训专家。近几个月来，西方武器正源源不断地在全世界面前肆无忌惮地被运送到乌克兰。乌克兰武装部队和特种部队的活动正在由外国顾问领导，我们对此十分了解。 近年来，北约国家以演习为借口，他们的军事特遣队几乎不断地出现在乌克兰境内。乌克兰军队的指挥和控制系统已经与北约的指挥和控制系统整合在一起。这意味着乌克兰武装部队的指挥权，甚至是单个单位和子单位，都可以直接从北约总部行使。 乌克兰旨在加入北约 美国和北约已经开始无耻地开发乌克兰领土作为潜在军事行动的战场。定期联合演习有明确的反俄重点。仅去年一年，就有超过23000名军人和 1000多台设备参加了这些活动。 已经通过的一项关于2022年允许其他国家武装部队进入乌克兰领土参加多国演习的法律。从中很明显，这里就是指的北约部队。他们明年计划至少在乌克兰再进行十次这样的联合演习。 显然，此类事件为北约军事集团在乌克兰领土上的迅速集结提供了掩护。此外，在美国人的帮助下，现代化的机场网络——博雷斯皮尔、伊万诺-弗兰科夫斯克、楚格夫、敖德萨等等——都能够确保在最短的时间内转移军事单位。乌克兰领空对美国战略侦察机和用于监视俄罗斯领土的无人驾驶飞行器开放。 我想补充的是，美国人在奥恰科夫建造的海上作战中心使其有可能支持北约船只的行动，包括他们对俄罗斯黑海舰队和我们在整个黑海海岸的基础设施使用精确武器。 美国曾一度打算在克里米亚建立类似的设施，但克里米亚人和塞瓦斯托波尔的居民挫败了这些计划。我们将永远记住这一点。 我再说一遍，今天已经部署了这样一个中心，它已经在奥恰科夫部署了。让我提醒你，在十八世纪，亚历山大-苏沃洛夫的士兵为这个城市而战。由于他们的勇气，这里成为俄罗斯的一部分。同时，在十八世纪，由于与奥斯曼帝国的战争而被并入俄罗斯的黑海土地，被称为新罗西斯亚。如今，这些历史上的里程碑正在被遗忘，还有俄罗斯帝国的政治家的名字，如果没有他们的努力，现代乌克兰就不会有许多大城市，甚至是通往黑海的通道。 最近，亚历山大-苏沃洛夫的纪念碑在波尔塔瓦被拉倒。你能说什么呢？你否认你自己的过去？来自俄罗斯帝国的所谓殖民遗产？好吧，那么在这里要保持一致。 我应该指出，乌克兰宪法第17条不允许在其领土上部署外国军事基地。但事实证明，这只是一个可以轻易绕过的惯例。北约国家已经在乌克兰部署了培训任务。事实上，这些已经是外国军事基地。他们只要把基地称为“任务”就可以了。 长期以来，基辅一直宣称其战略路线是加入北约。是的，当然，每个国家都有权选择自己的安全体系和缔结军事联盟。看起来是这样，但有一个 “但是”。国际文件明确规定了平等和不可分割的安全原则，如我们所知，这包括不以牺牲其他国家的安全为代价来加强自身安全的义务。我可以在此提及1999年在伊斯坦布尔通过的《欧安组织欧洲安全宪章》和2010年的《欧安组织阿斯塔纳宣言》。 换句话说，安全的选择不能对其他国家构成威胁，而乌克兰加入北约是对俄罗斯安全的直接威胁。 我记得，早在2008年4月，在北大西洋联盟的布加勒斯特峰会上，美国推动了乌克兰和格鲁吉亚将成为北约成员的决定。美国的许多欧洲盟友已经很清楚这种前景的所有风险，但他们不得不忍受其高级伙伴的意志。美国人只是利用它们来推行明显的反俄政策。 联盟的一些成员国甚至现在都对乌克兰加入北约持非常怀疑的态度。同时，我们从一些欧洲国家的首都得到一个信号，说：“你在担心什么？它不会发生在字面上的明天”。事实上，我们的美国伙伴也在谈论这个问题。“好”，我们说，“不是明天，而是后天。从历史角度看，它有什么变化？从本质上讲，什么都没有。” 乌克兰总统泽连斯基与德国总理举行会谈 此外，我们知道美国领导人的立场和话语，即乌克兰东部的积极敌对行动并不排除该国加入北约的可能性，如果它能满足北大西洋联盟的标准并击败腐败。 然而，他们一次又一次地试图让我们相信，北约是一个热爱和平的、纯粹的防御性联盟。他们说，俄罗斯没有任何威胁。他们再次建议我们相信我们的话。但我们知道这种话的真正代价。1990年，在讨论德国统一问题时，美国向苏联领导人承诺，北约的管辖权或军事存在不会向东延伸一寸。而且，德国的统一不会导致北约的军事组织向东延伸。 他们虽然做了口头保证，但结果都是一无所获。后来，我们得到保证，中欧和东欧国家加入北约只会改善与莫斯科的关系，解除这些国家对困难的历史遗产的恐惧，而且，创造一个对俄罗斯友好的环境会对他们有好处。但结果恰恰相反，一些东欧国家当局兜售恐俄症，把他们对俄罗斯威胁的情结和成见带到了联盟，并坚持要建立主要针对俄罗斯的集体防御能力。而这发生在20世纪90年代和21世纪初，当时由于开放和我们的善意，俄罗斯和西方的关系甚至一度处于高水平。 俄罗斯履行了所有义务，包括从德国以及中欧和东欧国家撤军，从而为克服冷战的遗留问题做出了巨大贡献。我们一直提供各种合作的选择，包括在北约-俄罗斯理事会和欧安组织的形式。 此外，我现在要说一些我从未公开说过的话，我这是第一次说。当即将离任的美国总统比尔-克林顿在2000年访问莫斯科时，我问他：“美国对接受俄罗斯加入北约有何看法？” 我不会透露那次谈话的所有细节，但从外表上看，他对我的问题的反应看起来应该说是非常克制的，而美国人对这种可能性的实际反应方式实际上可以从他们对我国的实际步骤中看出。这包括公开支持北高加索地区的恐怖分子，对我们在北约扩大领域的要求和安全关切持轻视态度，退出《反导条约》，等等。可能你想问：为什么，俄罗斯为什么要这么做，为了什么？好吧，你不想把我们看作你的朋友和盟友，但为什么要与我们为敌呢？ 答案只有一个：不是因为我们的政治体制或其他原因，他们只是不需要俄罗斯这样一个独立的大国。这就是所有问题的答案。它是美国传统对俄政策的来源。因此，对我们所有的安全建议的态度。 今天，只要看一眼地图，就足以看出西方国家是如何“履行”其不允许北约东进的承诺。我们只是被欺骗了。已经有过五次北约扩张的浪潮，一次又一次：1999年，波兰、捷克共和国和匈牙利加入联盟；2004年，保加利亚、爱沙尼亚、拉脱维亚、立陶宛、罗马尼亚、斯洛伐克和斯洛文尼亚；2009年，阿尔巴尼亚和克罗地亚；2017年，黑山；2020年，北马其顿。 进而，北约带着它的军事基础设施，直接来到了俄罗斯的边境。这是欧元安全危机的关键原因之一，对整个国际关系体系产生了非常消极的影响，导致了互信的丧失。 局势继续恶化，包括在战略领域。例如，作为美国全球导弹防御项目的一部分，正在罗马尼亚和波兰部署反导弹的定位区。众所周知，放置在那里的发射器可用于战斧式巡航导弹，这是进攻性打击系统。 此外，美国正在开发一种通用的“标准-6”导弹，除了解决防空和导弹防御的问题外，还可以打击地面和水面目标。换句话说，所谓的防御性美国导弹防御系统正在扩大，新的进攻能力正在出现。 我们所掌握的信息使我们有充分理由相信，乌克兰加入北约以及随后在这里部署北约设施是一个定局，这是一个时间问题。我们清楚地认识到，在这样的情况下，对俄罗斯的军事威胁程度将急剧增加，而且是许多倍。而且我特别提请注意，对我国进行突然袭击的危险将增加许多倍。 让我明确指出，美国的战略规划中规定了对敌方导弹系统进行所谓先发制人打击的可能性。而且我们也知道美国和北约的主要对手是谁。这就是俄罗斯。在北约文件中，我国被直接宣布为对欧洲-大西洋安全的主要威胁。而乌克兰将成为这种打击的一个跳板。如果我们的祖先听说了这件事，他们可能不会相信。今天我们不愿意相信，但这是事实。我希望它在俄罗斯和乌克兰都能被理解。 许多乌克兰机场靠近我们的边界。部署在这里的北约战术航空，包括高精度武器载体，将能够打击我国领土，远至伏尔加格勒-喀山-萨马拉-阿斯特拉罕。在乌克兰领土上部署雷达侦察设施将使北约能够严格控制远至乌拉尔的俄罗斯领空。 最后，在美国打破《中程和短程导弹条约》之后，五角大楼已经在公开开发一系列地基打击武器，包括能够到达5500公里以外目标的弹道导弹。如果在乌克兰部署这种系统，它们将能够打击俄罗斯整个欧洲领土以及乌拉尔山脉以外的目标。战斧式巡航导弹到达莫斯科需要不到35分钟，从哈尔科夫地区发射弹道导弹需要7-8分钟，高超音速打击需要4-5分钟。这就叫，直接用刀架在喉咙上。而且，我毫不怀疑，他们期望实施这些计划，就像他们在前几年反复做的那样，向东扩张北约，将军事基础设施和装备推到俄罗斯边境，完全无视我们的关切、抗议和警告。对不起，他们只是在吐口水，他们还是做他们想做的事，做他们认为合适的事。 当然，他们也期望继续按照众所周知的那句俄罗斯谚语行事：“且让狗叫吧，大篷车继续开。”我愿说，我们没有同意这样做，也永远不会同意。同时，俄罗斯一直并仍然赞成通过政治和外交手段，在谈判桌上解决最复杂的问题。 我们清楚地意识到我们对区域和全球稳定的巨大责任。早在2008年，俄罗斯就提出了缔结《欧洲安全条约》的倡议。其本质是，北约的任何国家或国际组织都不能以牺牲他人的安全为代价来加强自己的安全。然而，我们的建议从一开始就被拒绝了：我们不能允许俄罗斯限制北约的活动。 此外，我们被明确告知，只有北大西洋联盟的成员才能拥有具有法律约束力的安全保证。 去年12月，我们向我们的西方伙伴转交了俄罗斯联邦和美利坚合众国之间关于安全保障的条约草案，以及关于确保俄罗斯联邦和北约成员国安全的措施的协议草案。 美国和北约的回应有大量的相似之处。有一些理性的争论，但都是关于次要问题的，看起来像是在试图偏离讨论方向。 我们做出了相应的回应，强调我们准备沿着谈判的道路走下去，但条件是所有的问题都要作为一个整体来考虑，作为一个整体来考虑，不把它们与俄罗斯的基本的，基本的建议分开。而这些包含三个关键点。首先是防止北约的进一步扩大。第二是拒绝允许联盟在俄罗斯边境部署冲击性武器系统。最后，集团在欧洲的军事能力和基础设施恢复到1997年签署《北约-俄罗斯成立法》时的状态。 这些正是我们的原则性建议，但却被有意忽略了。我再次强调，我们的西方伙伴再次表达了这样一种生硬的表述：每个国家都有权自由选择如何确保其安全，并加入任何军事联盟和同盟。换句话说，他们的立场没有任何改变，他们甚至同样提到了北约臭名昭著的 “门户开放 “政策。此外，他们还试图再次敲诈我们，再次用制裁来威胁我们。顺便说一下，随着俄罗斯主权和我们武装部队力量的增长，他们仍将实施制裁。而且，无论乌克兰局势如何，总是会找到或简单地编造出另一次制裁攻击的借口。而其目的是一样的——扼杀俄罗斯的发展。而且他们会像以前一样，即使根本没有任何正式的借口，也会这样做，只是因为我们现在和将来都不会损害我们的主权、国家利益和价值观。 我想说清楚，直截了当地说，在目前的情况下，当我们关于就原则问题进行平等对话的建议，在实际上并没有得到美国和北约的回应时，当对我国的威胁程度明显上升时，俄罗斯完全有权采取反措施以确保自身的安全。这正是我们要做的。 至于顿巴斯的局势，我们可以看到，基辅的执政高层不断公开宣称不愿意执行解决冲突的明斯克一揽子措施，对和平解决不感兴趣。相反，他们正试图再次在顿巴斯组织一场闪电战，正如他们在2014年和2015年已经做过的那样。我们记得当年这些冒险是如何结束的。 现在，几乎没有一天顿巴斯的城镇和村庄没有在遭受炮击。一大群部队不断使用攻击型无人机、重型设备、火箭、大炮和多管火箭系统，杀害了平民、封锁、虐待人民，包括虐待儿童、妇女和老人的行为，这些犯罪有增无减。正如我们在这里所说的，这些罪行没有尽头。 而所谓的文明世界（我们的西方同事自称是其唯一的代表）宁愿不注意到这一点，好像所有这些恐怖——近400万人遭受的种族灭绝并不存在，只是因为这些人不同意2014年西方支持的乌克兰政变，反对走向侵略性的民族主义和新纳粹主义。但他们只是在为自己的基本权利而斗争——在自己的土地上生活，说自己的语言，保护自己的文化和传统。 这种悲剧还能持续多久？我们还能容忍多久呢？俄罗斯为维护乌克兰的领土完整做了一切，多年来坚持不懈地为执行联合国安理会2015年2月 17日第2202号决议而斗争，该决议巩固了2015年2月12日为解决顿巴斯局势的明斯克一揽子措施。 但这一切都是徒劳的。总统和乌克兰议员虽然都在变化，但在基辅夺取政权的政权的本质和侵略性、民族主义性质并没有改变。这完全是2014年政变的产物，那些走上暴力、流血和无法无天道路的人没有也不会承认除了军事手段之外，还有其他解决顿巴斯问题的办法。 顿涅茨克共和国人民举俄罗斯国旗庆祝独立 对此，我认为有必要做出一个早就应该做出的决定——毫不拖延地承认顿涅茨克人民共和国和卢甘斯克人民共和国的独立和主权。 我请求俄罗斯联邦议会支持这一决定，批准与这两个共和国的友好和互助条约。这两份文件将在不久的将来编写好并签署。 而对于那些在乌克兰夺取和掌握权力的人，我们要求立即停止敌对行动。否则，所有可能继续发生流血事件的责任将完全由统治乌克兰领土的“政权的良心们”来承担。 在宣布今天通过的决定时，我对俄罗斯公民和我国所有爱国力量的支持充满信心。 谢谢大家！​​​​","tags":[{"name":"Putin","slug":"Putin","permalink":"https://blog.zfdang.com/tags/Putin/"},{"name":"普京","slug":"普京","permalink":"https://blog.zfdang.com/tags/%E6%99%AE%E4%BA%AC/"}]},{"title":"修复switch游戏无法启动的问题","date":"2022-02-22T12:19:39.000Z","path":"2022/02/switch-fix-unable-to-start-software-issue/","text":"有时候，Switch游戏会碰到无法启动的问题。如下面的两个截图： 无法启动软件，请在HOME菜单中再试一次: Unable to start software, return to HOME menu and try again: 尝试过各种方法，包括删除游戏重新安装，换不同版本的游戏，删除title等方法，均不起作用。 后来发现了一种方法，进入“维护模式” / “恢复模式” / “Recovery Mode” / “Maintenance Mode”, 什么都不用做，居然神奇的解决了这个问题！This issue could be fixed magically by entering Recovery Mode / Maintenance Mode 进入的方法： 主机系统 Stock System开机前按住音量+和音量-，之后按电源键开机 Press Volume + / -, then press power button to turn on the device 大气层系统 Atmosphere System在Hekate启动界面选择系统后，黑屏时按住音量+和音量-，等待即可After selecting system in Hekate menu, press volume + / - when the screen is dark, then wait 进入之后，什么都不要做，直接重启without any action in maintenance mode, reboot directly 重启方法长按电源键直接重启Press and hold power button to reboot the device 证明 / Proof动物森友会 2.0.5的截图 Animal Crossing New Horizons ACNH 2.0.5","tags":[{"name":"Switch","slug":"Switch","permalink":"https://blog.zfdang.com/tags/Switch/"},{"name":"ACNH","slug":"ACNH","permalink":"https://blog.zfdang.com/tags/ACNH/"}]},{"title":"北京2022冬奥会男子短道速滑1000m决赛的判罚争议","date":"2022-02-15T15:24:43.000Z","path":"2022/02/Men-s-1000m-Final-Results-Olympic-Short-Track-Speed-Skating-Beijing-2022/","text":"北京2022冬奥会男子短道速滑1000m决赛的判罚争议 Men’s 1000m - Final Results - Olympic Short Track Speed Skating @ Beijing 2022 People have disagreements about the results of Men’s 1000m Olympic Short Track Speed Skating at Beijing 2022. This short clip shows some rules and key moments for the decision. Chief Referee is Peter Worth from The Great Britain. This is the third Olympics game he has served as a referee. click here to see the video:Rules &amp; Key Moments 有些人对北京2022冬奥会男子1000米短道速滑决赛的成绩有不同的意见。这个短视频尝试解释相关规则和还原关键场景，让大家看看判罚是否真有问题。 点击链接观看视频：相关规则和关键时刻 关键字：北京2022冬奥会, 短道速滑, 男子1000米, 刘少林, 任子威, LIU Shaolin Sandor, REN Ziwei, Hungary, HUN, China, CHN","tags":[]},{"title":"更新HP MicroServer Gen8的各种固件","date":"2022-01-27T08:26:31.000Z","path":"2022/01/upgrade-HP-microserver-Gen8/","text":"作为一款外观经典的微型服务器，HP GEN8一直都是玩家手中的宝贝。最近把家里的这台服务器给升级了一下固件，总结如下： iLO作为HP的服务器，跟PC最大的不同就是有这个iLO。有了它，你就可以用1根电源线和2根网线，把它开启之后扔在角落里，永远不需要跑到它面前做任何操作了。 从这里可以下载: HPE Integrated Lights-Out 4 (iLO 4) https://support.hpe.com/connect/s/product?language=en_US&amp;tab=driversAndSoftware&amp;kmpmoid=1009143853#t=DriversandSoftware GEN8能使用的是iLO4, 当前版本是2.79, 2021-11-25日发布 升级之后，需要找一个license, 这样很多高级的功能才能使用。 如果喜欢中文，可以下载语言包，安装之后就可以选择中文或者英文了。 中文包 https://support.hpe.com/connect/s/search?language=en_US#q=Integrated%20Lights-Out%204%20Language%20Pack&amp;t=All&amp;sort=relevancy&amp;numberOfResults=25 最新的中文包是2.70版的，之后的版本也可以安装。 Intelligent Provisioninghttps://support.hpe.com/connect/s/product?language=en_US&amp;cc=us&amp;kmpmoid=1008862660&amp;tab=driversAndSoftware&amp;lang=en#t=DriversandSoftware GEN8 Intelligent Provisioning Recovery Media GEN8能使用的是1.x版本的IP，当前版本是1.74，2021-07-22发布 这里下载的是一个ISO, 在iLO里远程加载光盘，然后启动后自动更新服务器固件。 这里有一个简单的升级介绍： How to Reinstall or Upgrade Intelligent Provisioning System ROM (BIOS)HPE ProLiant MicroServer Gen8 Server- Drivers &amp; Software 2019.04.04 (12 Jun 2019) 下载之后，在iLO里可以远程升级。 当前版本2019.04.04， 2019-06-12发布 Service Pack for ProLiant (SPP)官方地址为： Service Pack for ProLiant (SPP) The 2017.04.0 SPP is the last production SPP to contain components for the G7 and Gen8 server platforms 但是GEN8的文件需要登录，可以从下面的地址下载： SPPGen81.4.iso SPPGen81.4.iso SPPGen81.4.iso 下面两个页面也有下载链接： http://www.kaixinit.com/server/gen8/1750.html https://technet24.ir/%D8%AF%D8%A7%D9%86%D9%84%D9%88%D8%AF-%D8%B3%D8%B1%D9%88%DB%8C%D8%B3-%D9%BE%DA%A9-hpe-service-pack-for-proliant-9872","tags":[{"name":"NAS","slug":"NAS","permalink":"https://blog.zfdang.com/tags/NAS/"},{"name":"GEN8","slug":"GEN8","permalink":"https://blog.zfdang.com/tags/GEN8/"}]},{"title":"在磁盘工具Disk Utility里显示所有设备","date":"2021-11-11T04:28:55.000Z","path":"2021/11/show-all-devices-in-disk-utility/","text":"MacOS升级之后，Disk Utility也给自己增加了功能，缺省不显示所有的设备。 如图1: 这使得对磁盘的一些操作无法进行。 比如更改磁盘的Partition Scheme Disk Utility not showing Partitioning Scheme Options (GUID, MBR, etc) 需要在菜单 View-&gt;Show All Devices来显示所有设备： 效果如下图：","tags":[{"name":"MacOS","slug":"MacOS","permalink":"https://blog.zfdang.com/tags/MacOS/"},{"name":"Disk Utility","slug":"Disk-Utility","permalink":"https://blog.zfdang.com/tags/Disk-Utility/"}]},{"title":"转载：中国参与朝鲜战争的真实原因","date":"2021-10-16T11:53:45.000Z","path":"2021/10/the-underlying-reason-for-china-to-participate-into-korean-war/","text":"转载一篇文章，解读了中国参与朝鲜战争的原因。供大家参考。 一、引言1950年爆发的朝鲜战争影响深远，虽然三年后签订了停战协议，但60多年过去了，问题并没有解决。而对于战争的起因和评价则是众说纷纭莫衷一是。随着苏联解体及部分档案的公开，一些真相浮出了水面。根据网上披露的材料及相关历史背景，本文提出全新的观点和分析，并对一些流行看法进行辨析和批判。 二、战争爆发前一年发生的相关关键事件先请看当时在中苏美之间发生的一系列事件的来龙去脉。 1949年12月6日，毛泽东动身访问苏联，主要目的是签订中苏新条约。因为事先有过充分沟通，毛泽东对拿回中长铁路和旅大港信心满满，用他的话说是条约要“既好看又好吃”。 1949年12月16日，毛泽东刚到苏联第一天会谈就直奔主题，讨论签订新条约的事，但斯大林突然抛出雅尔塔协定作为理由给顶了回去，然后就一直把毛泽东凉在一边。 斯大林向毛泽东解释说:1945年的那个与国民党政府签订的旧条约是根据苏、美、英三国缔结的《雅尔塔协定》签订的,而苏联正是通过《雅尔塔协定》才在远东得到了千岛群岛、南库页岛和中长铁路旅顺口以及蒙古这个战略屏障等。如果改动经过美国和英国同意的中苏条约,“哪怕改动一款,都可能给美国和英国提出修改条约中的涉及千岛群岛、南库页岛等等条款的问题提供法律上的借口”。因此,经过慎重考虑后,苏联才“决定暂不改动这项条约的任何条款”。 对此变故，毛泽东感到非常意外和失望。但很快他就又列出了包括条约的一系列项目，要求与斯大林举行第二次会谈。12月24日，第二次会谈如期举行。但这次斯大林对条约根本就不予理睬。毛泽东感到非常恼火，公开向苏方表示不满大发牢骚，并表示要提前走人。 美国对当时状况了如指掌，及时伸出了橄榄枝。 1950年1月5日，杜鲁门总统发表声明称：“在1943年12月1日的《开罗宣言》中，美、英、中三国元首申明他们的目的是使日本窃取于中国的领土，如台湾，归还中国。过去四年来，美国和其他盟国也都承认中国对该岛行使主权。 美国对台湾或中国其他领土从无进行掠夺的野心，也不准备以武装部队干预中国现在的局势。美国政府不准备采取任何足以把美国卷入中国内战的行为。”(对于美国总统拉拢中国的讲话，苏联的反应异乎寻常。1月7日凌晨一时,苏联外交部长维辛斯基在莫斯科紧急约见正在苏联访问的中华人民共和国中央人民政府主席毛泽东,建议中国外交部发表一个给联合国安理会的声明,否认前国民党政府继续为安理会中国代表的合法地位。中国发表声明后,如果国民党政府代表继续留在安理会,苏联就采取行动,将拒绝出席安理会。) 美国人怕中国没注意到或不满足，过了几天的1950年1月12日，美国国务卿艾奇逊在全美新闻俱乐部发表题为《中国的危机》的演讲，除了指责“苏联占据中国北部的四个区域”外，公开称国民党不是在战场上被打倒的，而是被中国人民抛弃了。赤裸裸要拉拢新中国。而且除了前几天提到的台湾外，这次把朝鲜半岛也作为价码抛出来吸引中国，声称远东防御圈不包括朝鲜半岛和台湾。 (苏联对此的反应更为激烈。当时斯大林要毛泽东发表一个官方声明反驳，苏联和蒙古也同时发表。据师哲的回忆，毛泽东问清楚了官方声明就是要外交部发表正式声明，却故意只让胡乔木以新闻署长的名义发表一个非官方的与记者谈话来应付。声明见报后，斯大林莫洛托夫都非常生气，把毛泽东找去责问，说这种私人性质的谈话“一文不值”。毛泽东却不予理睬，甚至要师哲收回为缓和僵持紧张气氛而请斯大林去住所做客的话，“不请他”。) 此前毛泽东为表示不满，闭门谢客拒绝外出参观等活动，并向苏联方面前来探访的人提到正在跟美国的盟友英国接近。西方舆论对中苏关系现状也议论纷纷，英国报纸甚至说毛被软禁了。迫于这一系列压力，斯大林最终被迫让步，1950年元旦那天请毛泽东出面会见记者辟谣，并同意签订一个新条约。但当时苏联拿出的多个方案都只有一些象征性内容而无实质条款。 1950年1月26日，在莫斯科的中国代表团向苏联提交了中国方面有关大连、旅顺和中长铁路协定的方案，这一方案几乎完全推翻了苏联的方案。 据沈志华得到的档案，在一份斯大林批阅签名的文本中，中国提出的内容全部被斯大林划掉，并标上许多问号和惊叹号，斯大林当时的气愤可想而知。 1月28日，经过艰难紧张的谈判，苏联方面回复中国代表团，基本上同意了中国的方案，但加上了一条：苏联有权自由利用中长铁路运兵和军用物资。对此，中国要求对等的利用苏联的西伯利亚铁路从东北至新疆自由运兵和军用物资。这不是要把刚割让的蒙古给包围了吗?这彻底激怒了苏方。最后这一条也基本上去掉了。 再看朝苏方面。 1月30日(注意这个时间，正是中国说要用西伯利亚铁路连接东北和新疆运兵)，斯大林给驻北朝鲜大使斯蒂科夫发去一封密报：若金日成想就攻打韩国问题与我会面，我随时准备同他谈。请将我的立场转达给金日成，你要强调我已做好准备帮助他。我们希望每年得到2.5万吨铅。 当斯蒂科夫告知金日成斯大林的复电后，金日成兴奋异常，一再追问：斯大林同志真的同意攻打南部吗?在得到肯定回复后，他表示将在10至15天内，如约发出苏联要的铅。 2月2日，斯大林再次致电斯蒂科夫：叮嘱金日成，对攻打韩国、用武力统一朝鲜的计划要绝对保密。电文中称：“无论是朝鲜的其他领导人，还是中国的领导人都不要知道，这是为了向敌人保密…… ” 两天后，金日成会见斯蒂科夫，要求将朝鲜人民军扩编，增到10个师，并请求提前使用1951年的苏联贷款，金额为7000万卢布。斯大林复电表示同意。金日成随即为再次访苏作准备。 而此前斯大林对金日成的野心是持完全相反态度的。 1949年，金日成受中国革命胜利鼓舞，也想统一全朝鲜，请求苏联支持。金日成、朴宪永两次强烈要求苏联军事援助，支持其对南朝鲜的进攻，但终为斯大林所婉拒。 当时斯大林告诫金日成：“南侵是不允许的。第一，北朝鲜人民军并未对南朝鲜军队形成真正的优势，人数上处于劣势。第二，南朝鲜还有美军，战事一发，他们要介入。第三，要记住苏美之间三八线分割协定仍然有效。如果我们首先违反，就不能名正言顺地阻止美国的介入。” 随后发生的事情： 1950年2月14日，中苏正式签订新条约。 1950年5月13日，在斯大林的授意下，金日成在开战前一个月才向中国通报情况，当时周恩来惊讶得不敢相信，当即中断会谈并向上报告，毛泽东当即紧急要求直接向斯大林证实。斯大林5月14日电报的答复是“国际形势发生了变化”。尽管电报中提到要征得中国的同意，否则要重新讨论，但以中国当时的地位，无能力也无理由阻止，只能无可奈何。 三、战争爆发后各方的表现1950年6月25日朝鲜战争爆发。中国是从国外报纸中才得到这个消息，美国在第二天就采取了军事干涉行动，并且进驻台湾海峡，而苏联多次不出席安理会会议，导致美国打着联合国的旗号组成联合国军正式介入。当时葛罗米柯提醒了斯大林：苏联代表应该参加安理会会议以否决任何不利决议。但斯大林却出乎意料地指示：苏联拒绝复会。然后就是北朝鲜在美国为首的强大的联合国军攻击下兵败如山倒。 1950年10月，对中国愿意出兵帮助金日成，但需苏联提供空军支援的的请求，斯大林以没准备好为由拒绝，说是要两个半月才能准备好，而且建议金日成去东北组建流亡政府。(1950年10月12日，周恩来在苏联黑海与斯大林讨论空军支援无果后，双方最后只好决定，放弃北朝鲜，让金日成及其政权和军队暂时退到中国的东北地区去。据此，他们分别正式通知了北京和平壤方面。10月13日，斯大林正式通知金日成说，中国人已经决定不出兵，金日成最好把他剩余的部队从朝鲜撤到中国和苏联来。14日苏联驻北朝鲜大使史蒂科夫报告说，他已经向金日成转达了斯大林的建议，金日成痛苦地表示他们将照此执行。中国几经反复仍然决定出兵，是毛泽东个人深思熟虑后坚持的结果。) 四、动机分析及推理白白搞丢一个朝鲜，这斯大林葫芦里卖的是什么药? 从当时发生的一系列事件可以得出，斯大林对于中共刚建国就逼自己归还中长铁路和旅大港非常不满——这是苏联在太平洋的出海口和唯一不冻港，是苏联远东战略利益的支撑点，是沙俄自彼得大帝以来梦寐以求的战略要地，是苏联出动百万大军打败日本关东军用鲜血收复的失地，并且得到苏美英雅尔塔国际协定以及与国民党政府签订的中苏条约的确认。 苏联迫于压力已经一让再让，最后只要求保留使用中长铁路运兵和军用物资的权利，竟然仍然遭到新中国抵制，这使他极为愤怒。在自己手里不明不白丢失祖辈历尽千辛万苦才得到的远东太平洋战略要地，他担不起这个历史罪责。明的既然不行那就来阴的。一边继续与中国谈新条约，一边马上一反常态秘密与金日成联系，支持朝鲜发动战争，特别嘱咐金日成要对中国保密。而且处心积虑提前退出了安理会。 这里还有一个重要的因素促使苏联不得不发动战争，那就是美国当时以台湾作价码拉拢中国，后来怕中国不满意，又加码把朝鲜半岛这个中国的传统势力范围用来吸引拉拢中国，尽管这些都不是美国自己的东西。美国声称放弃朝鲜半岛，意思就是美国放弃南朝鲜而苏联也要放弃北朝鲜，这是将苏联的军，相当于是要把苏联挤出太平洋。 如果美国没有对苏联将这么一军，苏联即使失去中长铁路，却还保有朝鲜。以后让朝鲜成为苏联卫星国，苏联还是可进入太平洋，只是没有现成的优良港口而且还要另修铁路，不太方便。而美国这种方式的紧逼使苏联没有了退路，把苏联逼到了必须挑起战争的境地。 斯大林敢于破坏自己签署的雅尔塔协定，一反常态支持金日成出兵攻打驻有美军的南部，单方面逾越雷池，却在联合国会场和朝鲜战场均不出面或不直接出面，目的就是要暂时牺牲北朝鲜换自己重新进军东北的理由或借口。让美国占领全朝鲜，苏联就可以名正言顺进军东北保护自己的中长铁路(记住，当时的中长铁路苏联是有所有权的)。 然后再以中立者身份在联合国会场出面，以维护和平的名义要求美国遵守雅尔塔协定退回三八线。这样朝鲜并不会丢，也保住了苏联的远东太平洋战略要地，更重要的是使中国摆脱美国的拉拢，处于苏联的严格控制之下。 斯大林可谓老谋深算，但有一点他万没有料到，那就是新中国这个昔日的东亚病夫竟然敢出兵对抗当时世界上最强大的美国联军，尤其是在自己拒绝提供空军支援后还决定出兵，而且居然一开始就把联合国军打得落花流水，打回了三八线。 按他的盘算，朝鲜在美国干预后兵败，金日成在东北流亡，美军兵临鸭绿江，威逼东北——新中国的工业中心。在中国危急并无力御敌时，就会来求他苏联帮忙抵抗美国，或者苏联直接以保护自己的中长铁路为由强行驻军东北，使刚刚签订的归还中长铁路旅大港协议成为一纸空文，并使中国处于苏联的牢牢控制之中。 但是战争结果却完全出乎意料，不仅苏联没有驻军东北的借口，而且反而使中国对朝鲜的影响力几乎超过了苏联，至少是再也不可能让朝鲜成为苏联卫星国了，等于苏联把朝鲜这个进入太平洋的跳板也丢掉了，完全失去了远东太平洋，相当于被赶回寒冷的低纬度地带。 五、对几个流行观点的辨析批判1、中国出兵是苏联要求的吗有人说，中国出兵是苏联要求的，是因为中苏签订了同盟条约，苏联是为了考验中国，中国出兵苏联才放心等等。其实，苏联所谓要中国出兵只是为了应付朝鲜做做样子，并不是真心的。中国出兵是出乎苏联意料的节外生枝。 首先，从军事角度看，朝鲜半岛是一个狭长地带，当时北朝鲜军队长驱直入孤军深入，其两侧后方非常空虚。在美国已经军事干涉后，这是一个明显的严重问题。如果说金日成没有军事头脑看不出来，苏联那么多将军元帅军事顾问必定明白。中国多次指出美军有在仁川元山等地登陆的危险，甚至几次向朝鲜和苏联表示可帮助防守，否则朝鲜人民军只能大踏步后退。 金日成向斯大林请示，斯大林不理睬，竟然说朝鲜这点困难算不了什么，相信朝鲜一定能挺住并取得胜利，致使美军顺利实施了仁川登陆。当时金日成也发牢骚，说为什么南边可以让别人来帮忙，为何北朝鲜却不能让中国帮助。等到美军已经呈现绝对压倒优势，金日成迫不得已直接向中国求助后，斯大林才不得不也做做样子要中国出兵支援。由此可见，苏联开始根本就不愿意中国出兵。 其次，在美军横扫朝鲜半岛，局势已经非常不利后，前面也提到，因空军支援问题谈不拢，中苏双方10月初在苏联黑海讨论后已经决定中国不出兵，斯大林当时就迫不及待通知金日成去东北建立流亡政府，这才是苏联的真实意图。 苏联说空军需要两个半月准备，纯粹是一个借口。因为早在抗日战争初期，苏联政府就曾派遣过志愿空军在武汉、重庆、南昌等地上空同日本空军作战。 朝鲜战争是苏联自己挑起的，而且战争已经进行了三个多月了，苏联空军却还再需要两个半月准备，这根本就说不过去，刚刚打完二次大战的苏军怎么可能要这么长时间准备。别说是两个半月，再过一个月朝鲜就亡了。斯大林说的两个半月准备，那就是要到12月底，正好跟麦克阿瑟当时计划的结束战争回家过感恩节在时间上惊人地一致，等于是战争已经结束了，苏联空军才准备好。 毛泽东得知没有空军支援后，仍然坚持要出兵，要求苏联尽快按承诺的不短于两个半月出动空军支援。在得知中国仍然决定出兵后，斯大林再次指示莫洛托夫转告周恩来：苏联将只派遣空军到鸭绿江北岸的中国境内驻防，两个月或两个半月后也不准备进入朝鲜境内掩护中国人民志愿军作战。 得知这一消息的毛泽东于17日再度紧急将彭德怀和高岗召回北京，并推迟了部队入朝时间。当然，毛泽东最终还是和彭德怀等达成了一致，必须出兵。 苏联不提供空军配合支援，就是希望中国知难而退不出兵，万一出兵也必败于美国为首的强大的联合国军。而毛泽东几经反复仍然坚持出兵，极有可能是他作为当事人早就洞察到了苏联发动战争的意图，只是不便说出来而已。 2、苏联发动战争只是为了获得韩国的不冻港吗有人分析说，斯大林挑起战争，只是为了得到可以替代旅顺大连的韩国不冻港。但这不能解释苏联在战争开始后的一系列消极作为，尤其是故意不行使否决权制止美国干涉。因为中国内战现成的例子摆在那，有充足理由。而且真想要得到韩国的不冻港的话，就应该提供充足的武器装备和人员，出动志愿空军协同作战，这样的话早就把韩国拿到手了。前面说过，苏联出动志愿空军是有先例的。 其实就算得到了韩国不冻港，意义也不大。因为没有了中长铁路这个陆上通道将苏联本土与港口连通，港口和舰队都有危险。当年日本就是看准了俄国铁路运输还没准备好，抓住机会提前发动日俄战争，以少胜多打败俄国港口守军及其太平洋舰队(包括不远万里前来增援的舰队)，夺得了旅顺口及南满铁路。 如果当时俄国铁路准备好了，日本根本就没有胜的可能。正是鉴于历史上血的教训，斯大林在中苏谈判中多次退让后，最后提出唯一要求——保留使用中长铁路运兵和军用物资的 权利。所以，2400公里的中长铁路才是关键，对中苏双方都是生死攸关。这是苏联的底线，而新中国也志在必得。 3、苏联是判断失误，以为美国不会或来不及干涉吗?还有分析说，斯大林误以为美国放弃了南朝鲜，以为美国不会或来不及干涉，所以发动战争。根据就是前面提到的美国在1950年初宣布防御圈不包括朝鲜半岛和台湾。其实美国这时候这样说是大有深意，因为当时毛泽东正在莫斯科因受冷落而大发牢骚，美国说的不包括台湾和不包括朝鲜半岛都是为了向中共示好，想拉拢新中国。前面提到，苏联对美国的拉拢动作均作出了激烈回应。 所以对这种背景下的外交辞令，作为当事人的斯大林，绝对不会得出美国会无缘无故主动放弃南朝鲜的判断。不过，金日成是局外人，不明白美国人说这话的真实含意和前提条件，他天真地以为美国放弃南朝鲜了。而斯大林正好利用这一点误导金日成，信誓旦旦地说要帮助金的统一大业，让北朝鲜以卵击石去攻打驻有庞大美军顾问团而且就在骄横的麦克阿瑟眼皮子底下的南朝鲜。 打个比方说明为什么不可能出现误判。假如有两巨无霸公司A(美国)和R(苏联)，都想揽下一个破产重组公司C(中国)的业务，而公司C已经表示明确意 向并跟R公司在谈，A公司不甘心，而且发现他们谈判时正在争吵，觉得机会来了，两次提出优惠条件(放弃台湾和朝鲜半岛)争取公司C回心转意，但公司C不为所动，只是利用公司A开出的优惠条件作为自己的筹码逼公司R多出价，最终仍然和巨无霸公司R签订了满意的合同。显然，三个公司都清楚，在合同正式签订后，那个没有拿到合同的巨无霸公司A开出的优惠条件就不存在了。 4、中国不应该出兵吗?还有人说中国不应该出兵，说什么得罪了美国，耽误了解放台湾，导致被封锁等等。 中国如果不出兵，而且和美国说好话拉关系，那会怎么样呢?首先就是北朝鲜的残余部队会呆在东北抗美(而且其中有原四野的三个朝鲜族师的残余，算得上地头蛇)，形成国中之国。然后苏联必然会以保护自己的中长铁路为名驻军。 最好的结局，苏联驻军东北后，美国在苏联的要求下妥协并退回三八线，东北、北朝鲜及中国东海等都成为苏联的势力范围;而最坏的结局，类似当年在东北搞日俄战争之类的悲剧可能又会重演。当然，美国后来也有可能意识到了苏联出兵东北的可能性，所以也不敢再出全力，担心是为苏联作嫁衣裳，最后甚至将不懂政治、一心要逞强来捍卫自己荣誉的麦克阿瑟赶走。 中国示弱不出兵还有一个可能结局，那就是，美国如果不向已经成功驻军东北的苏联妥协，而是支持蒋介石政权占领南部中国，美苏可能会再来一次雅尔塔式会谈重新瓜分中国。中国的“满、蒙、回、藏”在美苏的主持下独立，国共两方以长江为界分治，中国成为四分五裂的彼此敌对的多个国家。这将比一分为三的印度更惨。 所以，中国不出兵或者不是一出手就将美国为首的联合国军打回三八线，后果都将是非常严重的。很多人受意识形态干扰，看不清事情的实质。国内一些专家教授竟然也说毛泽东坚持出兵是出于革命狂热性，纯粹是信口开河。正是朝鲜战争胜利对国际上及新疆西藏等分裂势力所产生的巨大震撼力，才使中国得以保全不被肢解，才使中国有一个和平的建设环境。 至于台湾问题，需要指出的是，东北权益比台湾问题重要急迫得多。因为前者涉及内海控制权，而失去内海控制权就要亡国，这是事关生死的大事。何况台湾是由中国人在管着，自己人好商量，以后还可以处理。说抗美援朝耽误解放台湾是不懂得历史不晓得轻重。 5、中国没有抓住停战机会及早停战是错误吗?还有人说中国没有及时抓住停战机会，使战争白白拖了更长时间。这也是一种浅薄见解。 最希望早点停战的是朝鲜，因为它受不了了，多次想停战。中国却是越战越勇不想停，并且对朝鲜尽力说服甚至表示愿给予朝鲜补偿。中国通过朝鲜战争使国防水平上了一个大台阶，尤其是空军几乎白手起家锻炼成长到了世界中等以上水平，美国人惊呼：中国几乎是一夜间就跨入空军强国行列。而国际国内达到的政治影响效应更是不可估量。 打一个形象的比喻，中国在朝鲜战争中就象是武林高手玩乾坤挪移大法，一手把苏联的内功接入自己体内，另一手打击美国。相当于是借苏联之力借朝鲜的地盘打击美国，而中国的内功在战争中却得到了极大长进。所以对这样千载难逢的机会中国当然不愿意住手。最后是美国被打得受不了，被迫停战。而中国却抓住苏联继续吸取内力，最终在短时间内建立了完整的工业体系。 6、中国抗美援朝是一边倒是不好的吗?朝鲜战争时中国不存在选边站，中国是为自己而战，并不是因为一边倒或要交投名状才抗美援朝。中国抗美援朝不仅是表面上的抗美，还有暗地里的抗苏。事实上，开始只有毛坚持要出兵，亲苏派反而不同意出兵，高岗甚至说要等苏军一起出兵。中国不出兵的后果前面已经阐述了。 抗美援朝极大地激发了国内人民的自信心和热情，生产力突飞猛进，中国经济得到飞速恢复和发展，土改剿匪等各项工作都能顺利推进。西藏新疆等国内外分裂势力都受到极大震慑。中国的国际影响力更是今非昔比。 至于一边倒，中国在此前早就已经作了一边倒向苏联的选择，这是当时中国最好的战略选择，是非常明智的。如果倒向美国或想左右逢源，那就想都别想有可能让苏联签订归还中长铁路旅大港的协议。这样的话，中国的内海就会被苏联等外国势力控制，那就必然会亡国被肢解，明清亡国都是因为内海被敌人控制。 不仅如此，一边倒还有一个好处。打个比方，一边倒是相当于找当世武林两个高手之一学艺。苏联这个高手就在身边，不找苏联学艺而去找遥远的美国学，那是自找麻烦。如果保持中立你能学到艺吗?难道美国苏联争相向中国传经送宝?显然是不可能的。而利用甚至制造两高手之间的矛盾，使其中之一对自己无所保留地传授技艺才是最高谋略。这只要对比中国和印度的工业化和发展水平就清楚了。 7、中国刚建国就逼讨中长铁路旅大港没必要吗?为何在刚建国有求于人时，毛泽东要逼苏联归还中长铁路和旅大港?而与之类似的英国控制的香港却故意不收回?个人认为，不收香港是因为英国与香港远隔重洋，香港跑不出中国的手掌心，暂时留给英国可以起窗口桥梁作用。而中长铁路和旅大港却是苏联的西伯利亚连接太平洋的战略枢纽，苏联本土通过中长铁路与旅大港连通中国内海及太平洋并形成一个天然有机整体。 另外中长铁路也是刚被割出去的蒙古唯一可以不依赖中国的出海通路。不赶快拿回来尤其是不卡住中长铁路，苏联势力进入中国内海并在东北扎根，别说是蒙古必然依附苏联而不是中国，越来越远离中国，中国东北等地也会跟蒙古类似成为苏联的势力范围，苏联太平洋舰队将在中国内海游弋，等于是苏联控制了中国的内海。而失去内海控制权是注定要亡国的，明清朝都是失去内海控制权十年内亡国。 国民党蒋介石政权让度东北权益给苏联，就是不懂历史，为亡国埋下了祸根。蒋这样做是以主权换政权的卑鄙自私行为，是想借苏联力量压制甚至于灭共。如果蒋政权能够团结全国各派力量坚决抵制雅尔塔协定，大不了就是不要苏联帮助打日本。而当时日本已经是强弩之末必败无疑了，苏联的对日宣战无关大局。这再次反映了蒋政权攘外必先安内的卖国本质，跟当年对日本侵占东北不抵抗的性质是一样的。这种卖国政权是注定要灭亡的。 如果不是毛泽东有敏锐的历史眼光，建国第一件事就是坚持要收回东北权益，并力排众议毅然出兵抗美援朝;如果不是英勇的志愿军用鲜血生命保住了朝鲜，中国早已经被肢解，中华民族也不可能存在。所以说毛是大救星是一点也不夸张的。 六、战争的后续影响朝鲜战争胜利后，近两万苏联侨民也被“热烈欢送”走，苏联势力被驱除出东北。战争结果使中国对朝鲜的影响力几乎超过了苏联，等于苏联把朝鲜也丢掉了。赫鲁晓夫为挽回局面，防止中国倒向美国，只能加大投入，全力援助中国建设。 然后试探性地提出建立中苏联合舰队和长波电台基地，妄图长驻中国内海控制中国并辐射太平洋，却被毛泽东断然拒绝。苏联的太平洋舰队只能退回海参崴被敌对的日本韩国天然封锁，其航母因无立足点而消亡。有了朝鲜这个屏障，中国内海的安全得到进一步强化。中国在初步完成工业化和清洗掉亲苏派后，实施了联美抗苏的“远交近攻”战略。如今，苏联早就在中美苏“三国演义”中被整垮了。 历史总是惊人地相似。朝鲜对中国的屏障作用至关重要，明清亡国首先就是从丢失朝鲜开始的。朝鲜现在仍是热点，跟六十多年前的形势差不多，只不过当时是前有狼后有虎，而如今只剩狼在叫。敌人在用意识形态扰乱人们的视线，最近有人鼓吹放弃朝鲜，这是无脑言论甚至是别有用心的汉奸言论。 问题的实质其实还是毛主席那句话：帝国主义亡我之心不死。中国下一步需要整合朝鲜半岛、台湾乃至日本，冲出美国的包围堵截，实现对东亚的主导，最终把美国势力赶回美洲去，这才是真正的中华复兴。 (作者不详，本文来源：博客日报)","tags":[{"name":"朝鲜战争","slug":"朝鲜战争","permalink":"https://blog.zfdang.com/tags/%E6%9C%9D%E9%B2%9C%E6%88%98%E4%BA%89/"},{"name":"志愿军","slug":"志愿军","permalink":"https://blog.zfdang.com/tags/%E5%BF%97%E6%84%BF%E5%86%9B/"}]},{"title":"国行Switch可用的hosts配置","date":"2021-09-28T12:06:38.000Z","path":"2021/09/hosts-for-china-switch/","text":"和谐版的switch, 为了防止系统自动升级啥的，可以按照建议，把nintendo相关的域名给block了，参考 https://rentry.org/AvoidSwitchBan 不过在连接WIFI网络时，国行固件使用的是不同的域名来检测网络可用性，所以直接使用上面的hosts, 会导致系统认为网络不可用。 这是一个国行可用的hosts文件 123456789# File: /atmosphere/hosts/default.txt# Block Nintendo Servers127.0.0.1 *nintendo.*127.0.0.1 *nintendo-europe.com127.0.0.1 *nintendoswitch.*95.216.149.205 *conntest.nintendowifi.net95.216.149.205 *ctest.cdn.nintendo.net# connection check destination for china version221.194.155.207 *ctest.cdn.n.nintendoswitch.cn","tags":[{"name":"Switch","slug":"Switch","permalink":"https://blog.zfdang.com/tags/Switch/"},{"name":"Atmosphere","slug":"Atmosphere","permalink":"https://blog.zfdang.com/tags/Atmosphere/"}]},{"title":"MacOS下使用HammerSpoon来提高效率","date":"2021-09-27T03:55:50.000Z","path":"2021/09/use-hammerspoon-to-improve-efficiency-in-macos/","text":"从BTT到HammerSpoon之前一直都用BetterTouchTool来做一些快捷的操作。但是这玩意是收费的，之前买的一个license, 现在居然失效了… 就想尝试着看看有没有类似的软件可以替代，于是找到了HammerSpoon! HammerSpoon安装完之后，什么也干不了，需要自己来写配置文件，从而实现各种快捷操作，这个导致了它比较高的使用门槛！ HammerSpoon的配置这个是我的HammerSpoon配置： https://github.com/zfdang/hammerspoon-config 使用起来也比较简单： 12rm -rf ~/.hammerspoongit clone https://github.com/zfdang/hammerspoon-config.git ~/.hammerspoon 然后在HammerSpoon里reload config即可 实现的功能HyperKey: {“cmd”, “alt”, “ctrl”, “shift”} – 定义超级快捷键 1234567891011121314151617181920212223HyperKey + l: lock screen; 锁屏HyperKey + b: show battery status on screen；在屏幕上显示电量HyperKey + [: move app to left screen；把App移动到下一个屏幕HyperKey + ]: move app to right screen；把App移动到上一个屏幕HyperKey + return: maximize current windowHyperKey + left: resize current window to the left half of the screenHyperKey + right: resize current window to the right half of the screenHyperKey + up: resize current window to the top half of the screenHyperKey + down: resize current window to the bottom half of the screenHyperKey + x: launch application by x (see key2App in key-bindings.lua, you can customize it in your own way)&#123;&quot;CMD&quot;,&quot;Ctrl&quot;&#125; + up: volume up&#123;&quot;CMD&quot;,&quot;Ctrl&quot;&#125; + down: volume down 可以根据自己的需要，来定制功能。","tags":[{"name":"MacOS","slug":"MacOS","permalink":"https://blog.zfdang.com/tags/MacOS/"},{"name":"HammerSpoon","slug":"HammerSpoon","permalink":"https://blog.zfdang.com/tags/HammerSpoon/"}]},{"title":"在SONY电视上正确使用Kodi和回音壁","date":"2021-05-28T06:21:35.000Z","path":"2021/05/connect-soundbar-with-sony-tv/","text":"配置： 电视：Sony 65X8500G 回音壁：雅马哈 YAS-109 Kodi: 19.1 目标：解码音频，包括杜比(Dobly Digital) 和DTS Digital Surround。 回音壁支持格式一般在说明书里可以找到： 连接方式SONY电视的HDMI(eARC)，通过HDMI线，连接到Soundbar的HDMI OUT(ARC)口 电视设置直通模式改成自动。 To output DTS audio, follow these steps to set the Pass through mode to Auto: On the supplied remote control, press the HOME button. Select Settings. Select Display &amp; Sound. Select Audio output. Select Pass through mode → Auto. Kodi设置系统-音频-声道数：2.0 系统-音频-允许直通输出 系统-音频-启用杜比数字（AC3）兼容功放 系统-音频-启用杜比数字（AC3）编码转换 系统-音频-DTS兼容功放 测试播放不同的音源，然后按Soundbar的INFO键来检查收到的信号：","tags":[{"name":"Sony","slug":"Sony","permalink":"https://blog.zfdang.com/tags/Sony/"},{"name":"Kodi","slug":"Kodi","permalink":"https://blog.zfdang.com/tags/Kodi/"},{"name":"YAS-109","slug":"YAS-109","permalink":"https://blog.zfdang.com/tags/YAS-109/"}]},{"title":"国内快速稳定的公共DNS服务器","date":"2021-05-26T02:42:12.000Z","path":"2021/05/public-dns-server/","text":"各个运营商会自动分配可用的DNS服务器，如果担心这些DNS的质量（比如劫持啥的），可以选择国内的一些可靠的公共DNS服务器。 阿里云公共DNShttps://www.alidns.com/ 223.5.5.5223.6.6.6 腾讯 DNSPod公共DNShttps://www.dnspod.cn/Products/Public.DNS 119.29.29.29 百度公共DNShttps://dudns.baidu.com/ 180.76.76.76 114DNShttps://www.114dns.com/ 114.114.114.114114.114.115.115 ping一下，哪个快用哪个就成","tags":[{"name":"DNS","slug":"DNS","permalink":"https://blog.zfdang.com/tags/DNS/"}]},{"title":"在续航版硬破解Switch上运行Atmosphere大气层系统","date":"2021-02-13T03:03:14.000Z","path":"2021/02/run-atmosphere-on-sx-core/","text":"SWITCH破解的现状Switch的游戏机，到目前为止，有几个不同硬件版本的主机: 工程代号是Erista的老版游戏机； 工程代号是Mariko的新版主机，包括续航版和Lite版；在2019年中发布； 针对Erista的老版游戏机，可以采用软接的方式进行破解；软接之后可以引导第三方系统，从而可以运行Atmosphere大气层系统，来玩破解游戏。 但是对于Mariko硬件版本的新游戏机，目前唯一的破解方式是采用焊接额外芯片的方式，进行“硬破解”，然后运行SX OS系统来玩破解游戏。 硬破解的方法这个提供焊接芯片，并且提供了相应的破解系统的组织叫做Team Xecuter，提供的芯片的名字叫做SX Core, 提供的破解系统叫做SX OS. SX的官网: https://sx.xecuter.com/ SX CORE芯片： 破解的流程一般是: 分别购买Switch机器和破解芯片SX CORE 自行安装或者找人安装SX CORE芯片；操作比较复杂，需要拆机，然后把芯片焊接上去； 在TF卡安装SX OS系统(boot.dat), 并且去SX的官网去申请License 运行SX OS系统，开始游戏；在SX OS系统里，可以用SX Installer来安装游戏。 有几点说明： SX CORE芯片是基于硬件的破解，目前对于Mariko硬件版本的主机都有效，不区分Switch的软件版本； 但是SX OS需要随着Switch软件版本的升级而持续升级； 目前SX OS的版本是3.1.0, 只能支持Switch 11.0.0的软件版本。如果不幸升级系统到了11.0.1软件版本, 那么目前SX OS的最新版也是无法支持的； SX Team在去年底，被反盗版了。所以目前SX OS系统的进一步维护基本停滞了；并且SX CORE芯片的供应也出了问题，不太容易购买到了； Switch的游戏，一般会对系统的软件版本有要求，基本新游戏或者新的更新都会要求最新的系统版本； 那么问题来了：对于这些已经硬破解了的Switch主机，之后还能玩新的游戏，或者更新游戏么？ 一种做法是，对新游戏或者新更新进行破解，让它们不再需要最新版的SWITCH OS版本。这种游戏目前被称为Patched版本，对Switch OS版本的需求被改到了11.0.0, 也就是SX OS能支持的最高版本。 但这种方式俨然不是长久之计，以后如果游戏真的用到了新OS版本里的功能，就没法这么干了。 在硬破解的Switch上运行Atmoshpere大气层系统SX Team被反盗版端了。但是Atmosphere系统，采取了打法律擦边球的方式，不能直接被启动，也不直接支持玩盗版游戏，所以目前还比较活跃，没被取缔。最新版0.18.0已经支持Mariko版本的主机，和11.0.1的OS版本了。 Atmosphere大气层系统： https://github.com/Atmosphere-NX/Atmosphere 在使用了SX CORE芯片硬破解的机器上，如果能引导Atmosphere大气层系统, 是不是就完美的解决这个问题了呢？ SX CORE芯片在开机后，会去加载TF卡上boot.dat的文件，这个文件是SX OS的系统；如果SX OS支持加载Atmosphere系统，是不是就可以实现这个目标了呢？ 但是非常不幸，SX OS系统在某次更新后禁止加载Atmosphere的payload了！但是依然可以加载其他的payload, 比如Hekate；Hekate作为一个switch的bootloader，可以加载Atmosphere! 另外，SX team除了提供SX OS外，还提供了一个SX Gear的简单系统，这个系统唯一的功能就是在启动后，加载另外的一个payload，并且不需要License. 所以最后的解决方法就是: –&gt; SX CORE芯片–&gt; 加载 SX Gear (/boot.dat)：缺省加载payload.bin, 可以在boot.ini(/boot.ini)里配置自动加载Hekate(/hekate_ctcaer_5.5.4.bin)–&gt; 加载Hekate(/hekate_ctcaer_5.5.4.bin)，可以在配置(/bootloader/hekate_ipl.ini)里配置Atmosphere系统，或者其他整合好的系统–&gt; 加载fusee-primary.bin–&gt; 加载Atmoshpere系统或者其他整合好的三方系统 经过这么一个长链之后，Atmosphere大气层系统就被启动起来了。 上述的一些配置，可以参考下面的文件(注意：不是完整的系统，只涉及了SX Gear及其配置, Hekate及其配置，fusee-primary.bin)： https://blog.zfdang.com/img/2021/TF.zip 对应的几个软件的下载地址为： SX Gear: https://sx.xecuter.com/download/SX_Gear_v1.1.zipSX Gear本地备份：https://blog.zfdang.com/img/2021/SX_Gear_v1.1.zipHekate: https://github.com/CTCaer/hekateAtmosphere: https://github.com/Atmosphere-NX/AtmosphereSignature Patches: https://github.com/ITotalJustice/patchesShallowSea, 一个整合了Atmosphere、玩破解游戏补丁、各种Homebrew App的集成包: https://github.com/carcaschoi/ShallowSea NOTE如果之前使用过大白兔升级过系统，貌似 BOOT0, BOOT1会被破坏掉，导致无法正常引导Atmosphere大气层系统。 这时候，替换虚拟系统里的BOOT0, BOOT1就可以了。11.0.0的系统，可以使用这两个文件替换： 11.0.0的BOOT文件备份：https://blog.zfdang.com/img/2021/boot-backup.zip 然后替换TF卡里的这两个文件： emuMMC/SD00/eMMC/BOOT0emuMMC/SD00/eMMC/BOOT1 支持Switch国行版Switch国行版的出现，让国内玩switch游戏，变得更容易，虽然游戏的数量很有限，但是国外的游戏卡都可以直接玩，问题也不大。 所以还是要支持正版！","tags":[{"name":"Switch","slug":"Switch","permalink":"https://blog.zfdang.com/tags/Switch/"},{"name":"Atmosphere","slug":"Atmosphere","permalink":"https://blog.zfdang.com/tags/Atmosphere/"}]},{"title":"在2021年校招新员工欢迎会上的致辞","date":"2020-12-04T03:10:30.000Z","path":"2020/12/welcome-speech-for-2021-campus-hires/","text":"首先，我代表FreeWheel的Leadership Team，欢迎各位的加入！ 关于2020今年是很不平凡的一年，我们经历了很多跟以往很不一样的事情，有些事情让我们感到悲伤，有些事情让我们觉得愤怒，甚至还有些事情，让我们对未来产生怀疑，未来会更好么？同时，也有很多事情和人，让我们深深的被感动，让我们对未来依然充满着希望… 不管我们今年经历了什么，我们的情绪有什么样的变化，现在有一个重要的事情，会发生在诸位的身上： 毕业了，开始工作了！我们从小学开始，经历了初中，高中，大学，研究生，不知道在座的有没有博士生，如果有的话，还有博士阶段，算起来少的有18年，多的有20多年；这一路走来，不管我们喜欢还是不喜欢上学的日子，一个事实是，我们其实已经习惯了这种的生活。 关于读书和工作要开始工作了，工作跟上学有什么不同？ 很多人都说过，社会是一所更大的学校。这个没错，但是社会作为一个学校，它跟我们上学的时候的学校，有本质的区别。 上学的时候，我们从一开始，就知道，我大概会4年从大学毕业，每个学期有期中考试，有期末考试；我要上哪些课程，每一门课程，也都有自己的大纲。我只要学好了这些课程，在每次考试前做好准备，基本上就没啥大问题了。 社会这个大学，没有大纲，没有正式的考试，甚至现在连开始结束时间都变得模糊了。原来我们还可以期望60岁退休，现在越来越多的声音说，人的平均寿命越来越长，我们可能要越来越晚退休，甚至可能终生工作，而不是期待在某个时间点就结束工作了。 没有大纲，没有考试，不意味着所有人都一样了，这种成绩的不同，很快会体现在方方面面。比如说，一年一度的同学会… 有的同学说，庸俗！ 我佛性，我不比！可是这种成绩的不同，还体现在如果有一天，父母家人生病了，你是不是有足够的能力去救他们。 看到一个笑话，有人在问，为啥有些人不能吃学习工作的苦，却能吃生活的苦？回答也有点残忍：因为学习工作的苦，需要主动去吃；生活的苦，主动就上门了。 所以恭喜同学从学校毕业了，各位在学生生涯里，都是非常优秀的，但是毕业不是结束。人生的篇章才刚刚拉开序幕。我希望大家能够在这个新的阶段，也都能有优异的表现！ 套用最近一句比较装的话，这不是结束，甚至不是结束的开始，而可能只是开始的结束。 给同学们的建议我在FreeWheel工作了12年多了，我觉得FreeWheel在国内，如果谦虚一点的说，不是最好的平台，也是非常非常好的一个平台的了。所以恭喜各位在人生的这个新阶段能有这样的一个好的起点。 在这个新阶段开始的时候，我个人对同学们有3点建议： 1.持续学习，持续成长第一，持续学习，持续成长。学校教育，我个人感觉它是一个非常好的筛选机制，把一些能力强，意志力好的同学给挑了出来。但是学校传授的知识，要做好工作，过好这一辈子，是远远不够的。活到老学到老，对于现在这个时代，对于我们码农来说，真的要变成必要的事情了。 首先，大家要学习技术，学习业务；这个是我们做好团队分配给我们任务的根本；然后，我们要学习项目协调的能力，这使得我们可以组织项目，发挥更大的作用再然后，我们要学习团队合作能力，组织和激励人的能力，学习各种沟通管理的软技能，这使得我们可以带领团队，实现更大的目标 FreeWheel是一家2B的公司，我们的客户都是大型的媒体公司，比如NBCu, Turner等。我们重视的是和大型客户的协同发展，这就像是跟大象一起跳舞一样。这种协同发展需要良好的计划和执行来保障，所以我们不鼓励冲刺型的工作模式，比如996。但是这不意味着，8小时之外的时间，是给大家用来颓废的。这是FreeWheel给员工留下的自我成长的机会；对于我们年轻同学来讲，这是我们自我提升的最佳的机会：技术、业务、项目管理、团队管理、各种软技能…等等 要去学习提升的东西很多。 对于FreeWheel来讲，英语也是一个重要的技能。 FreeWheel也提供了各种各样的培训活动，也希望大家能充分利用起来这些培训。 所以第一点呢，持续学习，让自己在这个人生的新阶段，成长的曲线更陡峭一些 2. 制定自己的长期职业发展计划第二，有自己长期的职业发展目标，这个长期的目标，就是学校里的大纲，我们工作的指南针。 工作，是给资本家出卖劳动力，获取报酬。 职业， 是让自己在某个方向持续不断的提升，朝着自己的目标前进。 工作，有的时候，会有重复和无聊，但是从职业发展的角度看的话，思路就会不一样：我们能不能更快的做这些事情，有没有更好的方法做这些事情，甚至我们能不能把这些事情从根本上避免掉呢？我希望大家能够从职业发展的角度，来看待工作中的各种问题，这会让我们的工作做的更好，也会帮助我们成长的更好，公司和个人都能受益。 理想的情况是，我们的工作，和我们职业发展的想法是一致的，持续不断的工作使我们离自己的目标越来越近。 非常不幸，我个人的观察是，并不是所有人都有长期的目标，但是长期目标的缺失，无疑会让我们绕一些弯路而不自知。长期目标也是慢慢发现出来的，目标有的时候也会做调整，所以如果大家现在没有一个长期的目标，也不用觉得气馁。 但是建立自己的长期职业发展目标，这很重要。 3. 健康第三点，健康。如果按照清华的说法，为祖国健康工作50年，后面的路还很长。 FreeWheel提供了各种各样的俱乐部，比如羽毛球，篮球，足球等，希望大家能够积极参加这种活动，保持好革命的本钱。 持续学习和成长，有长期的职业发展目标，保持健康的身体！这是我对各位同学的建议。 结束语人生很长，世界很大。虽然我觉得FreeWheel非常好，但是我觉得这应该也只是各位同学人生旅行过程中的一段路。但是我相信FreeWheel的产品，技术，人，和文化，能够帮助大家在这一段路上，走的更快更好更开心！ 最后，再次欢迎大家加入 FreeWheel！","tags":[{"name":"FreeWheel","slug":"FreeWheel","permalink":"https://blog.zfdang.com/tags/FreeWheel/"}]},{"title":"OpenWrt下AdGuard Home如何和SSR Plus+共同工作","date":"2020-07-24T16:06:21.000Z","path":"2020/07/adguard-home-work-with-ssr-plus-in-openwrt/","text":"在OpenWRT下，使用AdGuard Home来简单去广告，同时使用SSR Plus+的GFW模式 总结了最佳的搭配模式为： SSR Plus+， 运行模式 为”GFW列表模式”；DNS解析方式 为 “使用PDNSD TCP查询并缓存” AdGuard Home，运行在1053端口。重定向模式 为： “重定向53端口到AdGuardHome” AdGuard Home, 上游DNS服务器设置为: 127.0.0.1:53 DNSMasq, 上游DNS服务器设置为: 223.5.5.5, 180.76.76.76 优点： 被block的DNS，会第一时间在AdGuard Home里被干掉；在AdGuard Home里，也能看到客户端的IP地址。 最终DNS解析的流程如下：","tags":[{"name":"OpenWRT","slug":"OpenWRT","permalink":"https://blog.zfdang.com/tags/OpenWRT/"},{"name":"AdGuardHome","slug":"AdGuardHome","permalink":"https://blog.zfdang.com/tags/AdGuardHome/"}]},{"title":"在Switch SX OS里如何安装和使用SX Installer","date":"2020-07-07T10:18:39.000Z","path":"2020/07/how-to-use-sx-installer-in-sx-os/","text":"SX OS本身是可以直接安装nsp格式的游戏的，但是如果追求更强大的安装工具的话，就需要使用SX Installer了。 SX Installer更强大的功能包括：支持安装nsz (压缩的nsp, 文件大小会小很多)，能把同一个游戏的升级包、DLC包同时安装，支持后台安装，等 SX Installer可以在team SX的网站里直接下载，目前的版本是V3.02 https://sx.xecuter.com/download/sxinstaller_v3.02.zip 安装把下载好的压缩包在TF卡解开，然后把switch/sx/里的那个nsp文件复制到TF卡的根目录，最终的目录结构如下： 在 SX OS的install功能里，安装上面的那个nsp文件。 安装完之后，退出SX OS。在主页的游戏界面，就会出现SX Installer的图标了。 注意：不要把switch/sx/这个目录删除了，这里的文件会被SX Installer使用到 配置SX Installer缺省不能安装unsigned的包，需要打开这个功能。 在Option-&gt;Install unsigned Code里，打开这个设置 按下A键后，会出现如下需要输入密码的界面: 在这个界面输入密码： 上、上、下、下、左、右、左、右、B、A、+ 使用SX installer启动之后，界面如下： New Games里，同一个游戏的多个包也被整合到一个条目里了，非常方便。 安装游戏时，界面如图： 左侧显示了这个游戏有多少个升级包，多少个DLC等，多个安装包都被收集在了这里。 右侧有一些选项。个人建议： 打开“install ALL DLC” 打开”Install Latest Update” 根据需要打开或者关闭”Delete After” 安装开始之后，可以按B键，把安装任务放到后台执行，我们可以同步进行其他操作。 注意事项 不能删除TF根目录的/switch/sx/目录 TF卡或者U盘里的游戏，需要把nsp/nsz文件都放到根目录里，貌似现在还不支持查找目录里的安装文件。好在SX installer会自动把这些文件按照游戏组织起来，使用起来也不算太不便。","tags":[{"name":"Switch","slug":"Switch","permalink":"https://blog.zfdang.com/tags/Switch/"}]},{"title":"联想M93P迷你主机","date":"2020-01-13T06:02:59.000Z","path":"2020/01/M93P-mini-desktop/","text":"记录一下打造联想M93P 1L迷你PC主机的过程 M93P使用的主板是Q87, 支持4代LGA1150的CPU和DDR3 1600的内存(非DDR3L内存)，SATA的2.5寸硬盘。 CPU在CPU的选择上纠结了好久，最后在intel cpu性能天阶图里，选择了性能几乎最好的志强E3-1265L v3, TDP是45W的，4核8线程，价格500多一点，配M93P正好合适。 附PassMark的CPU天阶图: https://www.cpubenchmark.net/CPU_mega_page.html 装上去的效果： 内存内存选择了协德的DDR3 1600 8G * 2。内存插槽在硬盘架下面，安装的时候需要把硬盘架取下来。 硬盘东芝的TR200 - 240G SATA3的SSD硬盘 整体效果机器内部黄色的纯铜散热器下面是CPU, 硬盘架下面是内存插槽 后面的接口, 有三个蓝色的USB口，一个DP口, 一个HDMI口，还要一个VGA口, 一个网口, 和黄色的电源口 前面板，两个USB口，黄色的可关机充电。可以看到Wifi和蓝牙的指示灯，还挺好看。 外置电源适配器, 使用的是65W的thinkpad的方口充电器 跟三星S10+的大小对比图: CPU过去几年发展速度一般， 这块志强的CPU凑活着还能用；大内存和SSD的硬盘对速度的提升更明显。 鲁大师最后上几张鲁大师，纯供娱乐。","tags":[]},{"title":"HP Microserver Gen8","date":"2019-12-29T12:04:01.000Z","path":"2019/12/HP-Microserver-Gen8/","text":"HP Gen8服务器买回来之后，一直没怎么折腾。原因有两个，一个是忙，一个是CPU啥的都太贵了。 如今CPU啥的都成了白菜价，这次趁周末，就折腾了一把： CPU。GEN8的绝配是E3-1265l v2, 当初的售价在1800左右，现在便宜了，淘宝上388入手。之所以说是绝配，一来是因为这块U是低功耗的，45w, 比原装的G1610T的30W只多了10w，散热应该不用担心。二来性能没有比这块更强的了 内存，闲鱼上买了一条原装的4G的，70块包邮 升级了System ROM， HPIP (HP Intelligent Provisioning), 还有iLO 升级固件，有一个SSP包可以安装，不过支持GEN8的最后的一个SSP包，也是两年前的了 P03093_001_spp-Gen8.1-SPPGen81.4.iso （可以在 https://www.chiphell.com/thread-1796234-1-1.html 下载） 所以运行完这个之后，还需要去hpe.com上面下载最新的system rom和ilo，还有hpip, 单独再次安装。 (System ROM和ILO都可以在ilo的管理界面升级，虽然上面只说了上载ilo固件) GEN8最大的坑，就是噪音问题。很多人已经总结的很好了，就是GEN8内置的raid卡，如果打开了，并且把硬盘设置成了raid0, 那么很多系统是没法读取硬盘的smart信息的，硬盘也没法休眠，一直处于raid卡的唤醒中。但是如果把raid卡禁用了，支持采用ACHI模式，风扇的转速又居高不下，噪音太大。 把iLO升级到了最新版本2.72, 然后把system rom升级到2019.04.04， 然后硬盘采用ACHI模式。发现风扇的转速在15%左右。 想追求更低的噪音，就刷了破解版的1.32的iLO，发现风扇的转速只有8%， 比15%安静了不少。问题也很突出，iLO只有1.3.2版的，2.7.2支持了HTML5的remote console。好在ilo也不太常用，还是安静一点更重要，就坚持使用这个1.32的ilo了 见图： 附破解版1.32 ilo： iLO-1.32-cracked","tags":[{"name":"NAS","slug":"NAS","permalink":"https://blog.zfdang.com/tags/NAS/"},{"name":"GEN8","slug":"GEN8","permalink":"https://blog.zfdang.com/tags/GEN8/"}]},{"title":"香港，窗口和蜜罐的宿命","date":"2019-07-25T00:43:20.000Z","path":"2019/07/hong-kong-window-and-honeypot/","text":"一直以來，香港的定位就非常明確，這個地方就是一個試驗區。試驗什麼？試驗哪一種社會制度能夠讓中國人活得更好。但既然是實驗，那就會有兩種結果，一種好，一種壞，在結果出來之前，沒有人知道是好還是壞。 转载自公众号： NE0 （原文已被删除） 原文：香港，窗口和蜜罐的宿命.pdf 很多朋友在後台點名要談香港，姑且就說說我自己的看法吧。要解開香港的死結，有三個問題是需要回答的： 第一個，是香港這個城市的定位，即它對中國大陸來說最終會扮演一個什麼樣的角色； 第二個，是中國執政黨的治國理政思路，尤其是鄧小平本人對於香港的看法； 第三個，是在大的歷史趨勢中，我們究竟需要香港這個城市來達成我們對外和對內的一個什麼目的； 在談這些問題之前，有一個可以明確的地方是，我們既然是可以談香港問題，甚至大部分人在主流媒體上看到香港暴徒的各種行為，肯定是得到了許可。（也就是很多人擔心的失控，是多餘的） 沒有在宣傳系統待過的人對這些肯定無感，但任何在宣傳系統待過的人應該都知道，涉及到港澳台和國外的新聞，都屬於高度敏感的話題，大到新聞報導的方向，小到相關特定名詞的引用，都會被篩選過。 也就是說，能被你看到，肯定是國家想讓你看到。（那你就該想想，國家讓你看到這些，是為什麼？） 大約是9年還是10年前的7月份，那時我還在香港對岸，2009，2010年左右，正是公知推牆黨們最猖獗的那段時間，7月1號，香港那邊又開始衝擊西環，上街，縱火，燒旗，比今天的潑黑水有過之而無不及，但哪怕是一水之隔，大陸這邊根本不會有任何大規模的消息，也就是說，得益於方濱興校長的努力，其實只要這些信息，想隔絕是完全可以隔絕的。 然而這次沒有，這次，放開讓大家看這群暴徒。 所以，為什麼？ 這就要從上面的第一個問題，香港自身的定位開始。 一直以來，香港的定位就非常明確，這個地方就是一個試驗區。 試驗什麼？試驗哪一種社會制度能夠讓中國人活得更好。但既然是實驗，那就會有兩種結果，一種好，一種壞，在結果出來之前，沒有人知道是好還是壞。 我們站在今天，去比較中國大陸和香港這些年的發展，自然能得出中國大陸制度的優越性，但放你去四十年前，你有能力看到當下的這些局面嗎？別說四十年前，十年前的天涯之類的論壇，很多熱帖還在討論中國經濟能否在2030年超越日本，說能的人幾乎都被要嘲笑一番過於激進，然而十年後，若按購買力平價指數計算，我們的經濟規模其實已經超越了太平洋對岸那個敵國。 不管今天在中國大陸的那些有不滿的人是如何不滿，至少你們是站在全世界經濟總體實力第二強的國家的國土上吐槽，而不是像川普口中那些shit hole國家的人一樣在飢寒交迫中連抱怨的力氣都沒有。 我個人覺得，會有香港這個「試驗」，是中國執政者的典型政治智慧和執政手法的一個延續。按照我自己的理解，毛澤東給這個國家以及往後的執政團隊留下的最深刻的痕跡就是四個字：實事求是。不管是何種社會制度，它最終是要拿來被人用的，一切問題的核心，在於人。 也就是說，只要能讓人民過上更好的生活，能讓這個國家的國力更加強盛，其它的東西，都只是手段，而不是目的，能為我所用的，就是好的，不能達到我們目標的，吹得再天花亂墜，都是廢話。 經濟領域的分配製度，不管是「資」，還是「社」，它們都最終要歸於毛澤東在創立這個國家時立下的最終的目的：「為人民服務。」 我們跟蘇聯走上了兩個完全不同的結局，正是因為我們的執政團隊有一個最終的目的，也可以說最初的初心，而不是僵化地陷於二元意識形態之爭。 你們有沒有想過，當年的鄧小平在制定一國兩制這個試驗的時候，是不是必須要考慮一個問題，那就是：萬一，我說的是萬一，站在當時來看，50年後，如果香港各個方面都優越於中國大陸，那麼到時候會怎麼辦？ 很幸運的是我們現在永遠不會擔心這個問題了。但這個我們永遠不用再擔心的問題正是香港這個地方存在的意義。 在我們不夠好的時候它可以給我們展示一個運作良好的社會是怎麼樣運作的，在我們比它好的時候，它能給我們提供一個社會樣本的崩潰和衰落，是如何進行的。 當年的深圳，說難聽點的話，只是圍繞這個試驗而設置的一個緩衝區。香港一個點，深圳一個緩衝區，然後是廣東一個更大的緩衝區，再後面才是廣大的內陸腹地。 不管是香港還是深圳出了問題，都可以在小範圍內隔離開來，不至於對廣大的內陸腹地造成更大範圍的影響，我覺得這是一個負責任的執政者應該有的態度。 在看待香港出現的所有問題的時候，要時刻記住：這是一個用於試驗的地方。基於這個定位，你們的很多困惑是可以迎刃而解的。 要解決香港現在的很多的問題，其實當年直接一國一制就好了，為什麼不呢？因為： 一個二線城市易得，而能拿一整座城市七百萬人來做試驗的機會難找。 今天你們擔心什麼香港要亂，解放軍再不動作就如何如何，其實是多餘的，別忘了，香港跟深圳只隔了一條淺淺的河，別說是香港，哪怕是美國，如果它跟中國之間只隔了一條河，那它也得十條航母砍掉九條把錢拿來造坦克。 如果把中國這個國家比作一個完整的人體，那麼香港就好比是一個在逐步病變的部位，但是幸運的是，雖然這個部位屬於人體，但它又不是嚴格意義上的連在一起，我們完全可以在一個安全的距離來觀察這塊病變的肌體。 從中醫的角度來看，身體時不時感個冒，發個燒，其實不是什麼壞事，因為這是身體在提醒你，可能最近過度操勞了，休息不夠了，抵抗力弱了，是一個讓我們可以反思自身，給自身一個調養時間的機會。 很多人往往平時透支得很厲害，但身體也一直沒事，但一有事，那往往就是大病，這實際上就是在過度透支自己的身體的時候，大腦選擇了主動屏蔽身體發出的需要休養的信號，強行透支，導致平時看起來沒什麼問題，裡面的病灶已經在瘋狂積累，一到臨界點，撐不住就是大病一場。 治理國家，其實是一樣的道理。 中國數千年曆史，多少盛世，其實在一片歌舞昇平下已經暗暗埋下了各種病變，如今我們有一個可以隔離開來的病變部位，實際上可以不斷地刺激我們肌體裡產生源源不斷的免疫細胞，不好嗎？ 如果從本文開頭的第三個問題來看，香港在對內和對外，實際上有兩個作用。 對內，它在現在和未來，都是一個窗口，用於展示所謂的實行資本主義制度和西方三權分立及海洋法系法律制度的地方，會出現多麼可怕的貧富分化和社會動盪，而這在外國勢力的干涉下，又會演變成多麼混亂的局面。 這可以時刻抽打著那些希望在中國實行資本主義和西方政治制度的壞人，同時讓普通的中國民眾去認識到我們自身的製度的優越性。 三個自信是怎麼出來，不是說出來的，而是做出來的，比出來的。 此外，官方渠道大張旗鼓地報導香港那些暴徒的惡劣行徑，實際上是為另外一個方向的引導做鋪墊：台灣。 宣傳機器全力開動的理由只有一個：爭取民心，佔領道德制高點。 我一再提醒，台灣問題不會一拖再拖。 在解決台灣問題之前，我們有必要提前讓大多數國民凝結到一起，把那些分裂分子以及他們背後的英美勢力醜惡的一面展示給大多數國民。 大多數人看到的是香港，而我看到的滿滿都是兩個字：台灣。 一國兩制的試驗實際上已經結束了，未來的二十年不可能出現任何不一樣的結果，所以，香港的動亂，實際上會為台灣的一國一制鋪上正軌。 香港的這些動亂分子鬧得越兇，實際上越在輿論和宣傳上為我們提供了更多的彈藥，那些頭腦發熱的年輕人根本沒有任何政治頭腦，他們只是一群供人任意操縱的棋子，等待他們的，只有被人賣了還得替人數錢的下場。 而對外，香港則是一個我們設置給外部敵意世界的一個「蜜罐」，也就是駭客攻防中常說的一個術語「Honey Pot」。 對於電腦世界來說，蜜罐的定義是：「蜜罐是一個安全資源，它的價值在於被探測、攻擊和損害。」蜜罐技術本質上是一種對攻擊方進行欺騙的技術，通過佈置一些作為誘餌的主機、網路服務或者信息，誘使攻擊方對它們實施攻擊，從而可以對攻擊行為進行捕獲和分析，了解攻擊方所使用的工具與方法，推測攻擊意圖和動機，能夠讓防禦方清晰地了解他們所面對的安全威脅，並通過技術和管理手段來增強實際系統的安全防護能力。 蜜罐故意設置成容易讓人攻擊的目標，引誘駭客前來攻擊。一旦攻擊者入侵後，我們就可以知道他是如何得逞的，透過蜜罐還可以通過竊聽駭客之間的聯繫，收集駭客所用的種種工具，並且掌握他們的連接節點。 一台合格的蜜罐擁有：發現攻擊、產生警告、強大的記錄能力、欺騙、協助調查等功能。 蜜罐機看似漏洞百出卻盡在掌握之中，一個合格的蜜罐收集的入侵數據是十分有價值的。 以上的電腦術語，如果我們把它通過詞語的置換替換成政治性話語，那就是通過佈置香港這麼一個作為誘餌的城市，誘使歐美對我們懷有極大敵意的外部勢力來對它實施攻擊，在這個攻擊過程中，我們來觀察和對他們的攻擊行為進行捕獲和分析，了解歐美敵對勢力所使用的工具與方法，他們是怎麼煽動，又是怎麼控制輿論的，他們是從什麼渠道滲透，又是透過什麼方式進行溝通的，他們下一步的攻擊手法和時機會是什麼…… 一個香港，實際上能夠讓我們清晰地了解我們未來可能面對的安全威脅，了解我們的敵人都有哪些手段，是怎麼培養代理人，是怎麼樣組織那些動亂分子的，我們可以如何通過技術和管理手段來增強實際我們自身的安全防護能力，以及如何有效反擊回去。 我還是那句話，一個二線城市易得，而一座能夠拿來當蜜罐的城市難找。 你們真覺得沒法收拾那幾十個小魚小蝦？香港自50年代起就作為一個東亞情報角力中心，在回歸之前我們就已經耕耘了幾十年，即使在英國人統治時期我們的情報工作也從未落下風，更何況回歸之後。 不收拾他們，自然有沒到時候的理由。 如果我們真要連根拔除，其實前幾天就有一個最好的機會。 7月20日，香港警方在荃灣一座工廠大廈單位內發現包括至少1公斤TATP烈性炸藥及10枚燃燒彈在內的爆炸品。 這條新聞不熱，甚至已經被其它新聞迅速掩蓋過去了，但在我看來，這卻是一條非常非常重要的線索。 1公斤烈性炸藥，是什麼概念？ 一顆67式的裝藥大概是38克TNT，殺傷範圍是10米。TATPT的威力大概是TNT的80%，也就是說50克的TATP大概就相當於一顆67式。一公斤，差不多是20顆進攻手榴彈的威力。一旦用於人口密集的區域，殺傷力絕對不可小看。 但立馬抓捕是不是最好的選擇？在我看來未必是。 如果是我，其實很可能不會選擇在其沒有製造完成的時候進行抓捕。 在珍珠港事件發生之前，其實美國軍方早已經破解了日本人的秘密，羅斯福早就知道珍珠港會遇襲，那為什麼一定要讓珍珠港遇襲？那是因為珍珠港那些人命，能換來他想要的結果。 政治很多時候就是那麼冷冰冰。 比起TATP更重要的，其實是那些TATP，會被用到哪裡。 查獲的地方在荃灣，而如果我是那些恐怖分子，必然會選擇兩種地方下手，一種是有重要政治性意義的目標，西環，另外一種是可以大規模殺傷特定人群，例如有大量大陸游客的 地方。 能查獲TATP，說明我們能夠掌握那些恐怖分子內部（懂我意思吧）的情況，既然我們能夠掌握TATP的相關情報，那麼我們就應該等他們在準備襲擊之前再將其攔截，坐實他恐怖分子的罪名，而不是什麼非法持有爆炸物。 而沒有像我說的這樣，說明現在還沒有到收網的時候。真要一網打盡，完全可以等爆了，軍隊立馬接管。所以在此時選擇大事化小，顯然我們還有時間，給那些跳梁小丑繼續出醜，然後再收緊絞索。 跳梁小丑們，根本不知道，現在能夠讓他們跳，是因為前面已經給他們鋪好了一條死路。 而香港，這座我曾經工作和生活過一段不短時間的城市，雖然我對它還是有很多複雜的感情，也希望它能好，但它要迎來新生，恐怕要等到新一批能夠正確認識和擺正香港跟大陸關係的年輕人走到前台，實現跟大陸真正的融合，才是它擺脫作為一個失敗的試驗品的一天了。","tags":[]},{"title":"破解北京联通的光猫TEWA-800E","date":"2019-03-02T08:59:16.000Z","path":"2019/03/crack-unicom-fiber-modem-TEWA-800E/","text":"最近更换了联通的光猫，型号是TEWA-800E, 结果发现联通小哥给装好以后，PPPoE的连接直接在光猫上进行了，自己的路由器只能拿到内部192.168.1.x的内部IP。这个没法接受啊 以路由器上标注的账号登录，只能是普通用户模式，很多设置的选项都不存在。搜了一下，发现现在已经有办法可以以CUAdmin/CUAdmin模式登录了。破解主要集中在两点： 页面不显示用户名, 只有输入密码的地方，因为“user_name”这个field已经被固定设置为”user”. 第一步就是要把这个field value给改成CUAdmin了 （F12找到”user_name”，将value修改为CUAdmin） 页面有javascript, 当提交登录时，如果用户名不是user, 就提示错误并且禁止提交 （F12在Sources中找到一段限制非user用户不能登录的function定义，拷贝到Console中，删掉有关用户名限制的if判断，重新定义这个function） 上面这两个都可以通过dev tools直接修改。具体可以参考： https://guanggai.org/thread-563-1-1.html 以管理员登录后，改变Internet的设置，改成桥接模式就可以了。注意光猫里面的设置会有很多不同的连接，需要首先在“连接名称”里，选择了”2_INTERNET_xxx”这个选项，然后再改设置。如下图： DHCP也可以关闭 然后重启，就可以在自己的路由器上进行PPPoE拨号了","tags":[]},{"title":"保持谦逊","date":"2019-03-02T08:49:51.000Z","path":"2019/03/stay-humble/","text":"当面对一个新的团队时，一件重要的事情，是保持谦逊，因为你不清楚到底有多少坑…","tags":[]},{"title":"闲话架构","date":"2019-01-09T07:14:05.000Z","path":"2019/01/notes-about-architecture/","text":"到底什么是架构？软件架构到底是为了什么，要做什么？ 架构为了业务抛开业务谈架构，是没有价值的，架构不能离开业务单独存在。 因为业务的不同，架构也是多种多样。 架构的最终目标，是为了支撑业务，不能满足业务发展的架构，不是一个好架构 架构为了协作架构的目的，是为了使得团队规模变大时成员间的协作也能够顺利进行。如果一个团队，就那么几个人，那么讨论不同架构的价值意义很小。这时候，可能一个单体应用，是最适合的方法。 当团队规模变大时，我们需要在架构上将不同成员的工作解耦，使得每个人可以相对独立的完成自己的工作，而不用相互之间有很强的依赖性。 所以架构的要求，要能做到解耦，从而使得协作变得容易。 架构需要不断演化公司的业务和团队的规模总是在不断的变化。这种变化，使得架构要解决的问题也总是不一样的，所以架构要不断的演化。 不存在这么一个理想的架构，它在公司不同的发展阶段都是最好的。 架构要演化，就需要投入。 好的架构要能做到未雨绸缪，提前做好变化，从而能迎接团队、业务的变化。","tags":[]},{"title":"使用Fresco库时，显示超大图片时效果差的解决方法","date":"2018-12-11T09:37:34.000Z","path":"2018/12/fix-low-rendering-quality-issue-for-large-image-while-using-fresco/","text":"使用Fresco来处理和显示图片很方便。可是最近遇到一个问题，Fresco显示大图片时，效果特别差，模糊感特别强烈。 后来终于找到了解决办法： https://github.com/facebook/fresco/issues/916 Fresco’s max supported width/height in resizingIf you ResizeOptions, the converted one has a max size of 2048px, which makes wide or long image’s quality low. If you can cut the source into smaller one, its quality will be better. 后来Fresco改进了ResizeOptions了，可以设置maxBitmapSize了。 https://frescolib.org/javadoc/reference/com/facebook/imagepipeline/common/ResizeOptions.html 如果不担心收到的图片过于大的话，下面这个方法就很简单粗暴了： 1ImageRequestBuilder.newBuilderWithSource(Uri.parse(uri)).setResizeOptions(new ResizeOptions(Integer.MAX_VALUE, Integer.MAX_VALUE, Integer.MAX_VALUE))` 注意: 如果开启了硬件加速，android的OpenGL对图片的最大尺寸有要求。如果超过这个最大的size，图片直接显示空白，程序也不会报错。 参见： https://stackoverflow.com/questions/15313807/android-maximum-allowed-width-height-of-bitmap https://stackoverflow.com/questions/7428996/hw-accelerated-activity-how-to-get-opengl-texture-size-limit 解决方法就是把图片动态切成多个小图，显示成多个图片，然后拼接在一起。 这里有一个例子： https://github.com/zfdang/zSMTH-Android/blob/master/app/src/main/java/com/zfdang/zsmth_android/fresco/WrapContentDraweeView.java","tags":[{"name":"Android","slug":"Android","permalink":"https://blog.zfdang.com/tags/Android/"},{"name":"Fresco","slug":"Fresco","permalink":"https://blog.zfdang.com/tags/Fresco/"}]},{"title":"monorepo的讨论","date":"2018-10-24T07:42:23.000Z","path":"2018/10/monolithic-repository/","text":"所谓“天下大事，分久必合合久必分”，如今在代码库的管理上，也出现了这种争论：到底是使用多个代码库呢，还是使用单个的代码库？ multiple repositories v.s. monolithic repository monorepo的代表，有Google, Facebook等一众高大上的公司。 这里有几篇文章，供大家借鉴： Advantages of monorepos Why We Should Use Monolithic Repositories Why We Should Not Return to Monolithic Repositories 大家的意见呢？","tags":[{"name":"Monorepo","slug":"Monorepo","permalink":"https://blog.zfdang.com/tags/Monorepo/"}]},{"title":"从百度云盘快速下载文件","date":"2018-10-16T08:50:58.000Z","path":"2018/10/download-from-baidu-pan/","text":"百度云盘在经历过免费期后，现在对非付费用户的下载限速非常狠，经常只有10k左右，还经常下载失败。 码农肯定不会付钱买服务的，呵呵，所以就有快速下载百度云盘的方法出来了： 先安装Aria2 Gui for Machttps://github.com/yangshun1029/aria2gui 再在Chrome里安装百度Exporterhttps://github.com/acgotaku/BaiduExporter 下载的时候，先创建公开的分享，然后在分享的页面，就会出现导出到Aria2的按钮了 回到Aria2就可以看到下载的状态了:","tags":[]},{"title":"黄花城水长城","date":"2018-10-08T05:24:01.000Z","path":"2018/10/great-wall-in-water/","text":"从长城俯瞰水库","tags":[]},{"title":"MacOS下Cisco AnyConnect频繁要求管理员权限的解决方法","date":"2018-09-23T06:50:35.000Z","path":"2018/09/anyconnect-ask-for-permission-in-macos/","text":"MacOS下，Cisco AnyConnect客户端，经常要求输入管理员密码，并且没办法记住用户名或者密码，特别讨厌。 Mac OS wants to make changes. Type an administrator’s name and password to allow this: 后来终于找到了解决的方法： https://discussions.apple.com/thread/6995022 • Launch /Applications/Utilities/Keychain Access • Select “System” from the Keychains menu in the upper left • Select “Certificates” from the Category menu in the lower left • Find the entry that corelates to your computer’s name in the list on the right, and click on the disclosure triangle. • Secondary click on the “Private Key” entry that appears and select “Get Info” from the contextual menu that appears. • Select the Access Control tab. • You can then either add AnyConnect to the the list at the bottom of the screen (more secure, but you will need to repeat this process anytime the version of AnyConnect changes), or toggle the radio button to “Allow all applications to access this item”. 如下图： 完美解决！","tags":[{"name":"MacOS","slug":"MacOS","permalink":"https://blog.zfdang.com/tags/MacOS/"}]},{"title":"使用Github和Hexo来建立个人Blog","date":"2018-09-23T06:22:23.000Z","path":"2018/09/Blog-based-on-Github-and-Hexo/","text":"之前的Blog服务器被干掉了，结果数据还没有备份，有点坑爹了~~~ 重新开始! 现在github的repo, 支持使用repo中的/docs/目录作为项目主页，用Hexo来建立blog就非常方便了，如果想偷懒的话根本不需要deploy的步骤了。 修改hexo的输出目录修改_config.yml中的输出目录: public_dir: docs 然后 “/docs/“下面增加CNAME文件，指定blog的地址， 如 “blog.zfdang.com” $ hexo g 把repo push到github上 修改github repo的设置 收工！","tags":[]},{"title":"Hello World","date":"2018-09-22T06:00:00.000Z","path":"2018/09/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]},{"title":"android处理图片的一些问题总结","date":"2013-03-12T01:20:41.000Z","path":"2013/03/summary-of-image-processing-in-android/","text":"第一个问题是out of memory java.lang.OutOfMemoryError: bitmap size exceeds VM budget 这个据说是VM对一个程序申请的所有的bitmap对象会有一个最大值的要求。解决这个问题有几个方法： 从源文件生成图片时，直接将图片缩小，而不是加载原始大小的图片。如下代码： 123456789101112131415161718192021222324252627BitmapFactory.Options o = null;Bitmap bitmap = null;// decode image size (decode metadata only, not the whole image)o = new BitmapFactory.Options();o.inJustDecodeBounds = true;stream = new FileInputStream(filename);BitmapFactory.decodeStream(stream, null, o);stream.close();// get original image sizeint inWidth = o.outWidth;int inHeight = o.outHeight;clog(String.format(&quot;Original bitmap size: (%dx%d).&quot;, inWidth, inHeight));// get size for pre-resized imageo = new BitmapFactory.Options();o.inSampleSize = Math.max(inWidth/targetWidth, inHeight/targetHeight);// decode pre-resized imagestream = new FileInputStream(filename);// o.inPurgeable = true;bitmap = BitmapFactory.decodeStream(stream, null, o);stream.close();clog(String.format(&quot;Resized bitmap size: (%dx%d).&quot;, bitmap.getWidth(), bitmap.getHeight())); 这里有一个真实的例子： https://github.com/zfdang/asm-android-client-for-newsmth/blob/master/src/com/koushikdutta/urlimageviewhelper/UrlImageViewHelper.java 及时删除不需要使用的bitmap对象，不要将所有的对象都cache住 增加程序的heap size。从某个版本开始，android manifest文件里有一个新的属性了： android:largeHeap=&quot;true&quot; android:largeHeap Whether your application’s processes should be created with a large Dalvik heap. This applies to all processes created for the application. It only applies to the first application loaded into a process; if you’re using a shared user ID to allow multiple applications to use a process, they all must use this option consistently or they will have unpredictable results.Most apps should not need this and should instead focus on reducing their overall memory usage for improved performance. Enabling this also does not guarantee a fixed increase in available memory, because some devices are constrained by their total available memory.To query the available memory size at runtime, use the methods getMemoryClass() or getLargeMemoryClass(). 第二个问题是 Bitmap too large to be uploaded into a texture exception 这个问题下面链接有详细描述： http://stackoverflow.com/questions/7428996/hw-accelerated-activity-how-to-get-opengl-texture-size-limit 简单说就是硬件加速的时候，对图片的大小有限制。不同设备可能有不同的最大值。这个问题悲催的地方是，程序貌似没有捕获到这个exception, 结果是程序也不报错，图片也显示不出来。只有看debug log才能发现这个error message. 一个解决的方法是禁止硬件加速，简单粗暴： android:hardwareAccelerated=&quot;false&quot; android:hardwareAcceleratedWhether or not hardware-accelerated rendering should be enabled for all activities and views in this application — “true” if it should be enabled, and “false” if not. The default value is “true” if you’ve set either minSdkVersion or targetSdkVersion to “14” or higher; otherwise, it’s “false”.Starting from Android 3.0 (API level 11), a hardware-accelerated OpenGL renderer is available to applications, to improve performance for many common 2D graphics operations. When the hardware-accelerated renderer is enabled, most operations in Canvas, Paint, Xfermode, ColorFilter, Shader, and Camera are accelerated. This results in smoother animations, smoother scrolling, and improved responsiveness overall, even for applications that do not explicitly make use the framework’s OpenGL libraries.Note that not all of the OpenGL 2D operations are accelerated. If you enable the hardware-accelerated renderer, test your application to ensure that it can make use of the renderer without errors.For more information, read the Hardware Acceleration guide. 比较好的解决方法是类似google map的实现：将图片分成不同的小块，每次只加载需要的块。android提供了一个方法： http://developer.android.com/reference/android/graphics/BitmapRegionDecoder.html public void drawBitmap (Bitmap bitmap, Rect src, RectF dst, Paint paint) public Bitmap decodeRegion (Rect rect, BitmapFactory.Options options) 采取上述操作后，就可以加载很多图片，同时也可以显示超级大图了。 也有一个例子，是使用Fresco这个库来显示超长图片的： https://github.com/zfdang/zSMTH-Android/blob/master/app/src/main/java/com/zfdang/zsmth_android/fresco/WrapContentDraweeView.java 上面的例子里，图片如果过宽，先会被缩放到合适的宽度；然后根据高度和openGL支持的最大高度，把图片裁剪成多个符合要求的图，然后拼接在一起。","tags":[{"name":"Android","slug":"Android","permalink":"https://blog.zfdang.com/tags/Android/"},{"name":"Fresco","slug":"Fresco","permalink":"https://blog.zfdang.com/tags/Fresco/"}]}]